[
    {
        "text": "gill lê đẳng cấp",
        "category": "lgbtq",
        "id": "lgbtq_4586",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The phrase 'gill lê đẳng cấp' is a playful, phonetic approximation of 'Gucci level' or 'Gucci class', commonly used in Vietnamese teen slang to denote something high-end, cool, or top-tier. There is no insult, sarcasm, negative targeting, or culturally demeaning context present. It expresses admiration or positive emphasis without toxicity.",
        "toxicity_mistral_reason": "The phrase 'gill lê' is a derogatory deformation of 'gái lễ' (religious woman, often referring to nuns or devout Christian women), used mockingly. 'Đẳng cấp' (class/level) here is sarcastic, implying the person is pretentious or hypocritical in their religious devotion. The tone is demeaning toward a specific group (religious women).",
        "toxicity_qwen_reason": "The phrase 'gill lê đẳng cấp' appears to be a phonetic or stylized way of saying 'Gill Lê đẳng cấp', likely referring to a person named Gill Lê with a tone of admiration or irony. 'Đẳng cấp' means 'classy' or 'high class' and is often used humorously or sarcastically online. Without additional context indicating mockery, insult, or targeting a group, and given the common use of such phrases in playful or ironic compliments in Vietnamese internet culture, this does not meet the threshold for toxicity. It lacks clear derogatory intent, profanity, or harmful stereotypes.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Lời khen ngợi ‘đẳng cấp’ dành cho Gill Lê, không có xúc phạm, miệt thị hay ngôn từ tiêu cực."
    },
    {
        "text": "ko chập nhận đc, thế hệ tương lai sẽ ntn.",
        "category": "lgbtq",
        "id": "lgbtq_13564",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "Câu nói bày tỏ sự lo ngại chung về tương lai ('thế hệ tương lai sẽ ntn') và thất vọng ('ko chập nhận đc'), nhưng không nhắm vào cá nhân hay nhóm cụ thể nào, không sử dụng ngôn từ xúc phạm, phân biệt đối xử, hay có ý chế giễu. Đây chỉ là một bình luận mang tính chất quan sát xã hội với giọng điệu trung lập.",
        "toxicity_mistral_reason": "The comment expresses strong disapproval or frustration in a generalized and emotionally charged way ('ko chập nhận đc'), implying a negative judgment about 'thế hệ tương lai' (future generations). While not directly insulting, the tone is harsh and dismissive, introducing unnecessary negativity and hostility into the discussion.",
        "toxicity_qwen_reason": "Câu nói thể hiện sự lo ngại hoặc thất vọng về một tình huống, nhưng không sử dụng ngôn từ xúc phạm, miệt thị hay nhằm tấn công cá nhân hoặc nhóm. Việc băn khoăn về tương lai thế hệ sau là một phản ứng có tính chất cảnh báo hoặc suy tư, không mang tính chất độc hại.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Chỉ bày tỏ sự không chấp nhận và lo lắng về tương lai, không có từ ngữ xúc phạm, miệt thị hay nhắm vào cá nhân/nhóm nào."
    },
    {
        "text": "phố nhỏ biết gòi, lạng sơn❤️, mà lạng sơn ở đâu thì lại hết biết🤣",
        "category": "region",
        "id": "region_4493",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "The comment expresses lighthearted, self-deprecating humor about not knowing the location of Lạng Sơn province despite mentioning it. The tone is playful and friendly, indicated by the heart and laughing emojis. There is no insult, mockery, or negativity directed at any person, group, or region.",
        "toxicity_mistral_reason": "The text uses playful and lighthearted language ('phố nhỏ biết gòi', 'hết biết') combined with a heart emoji (❤️) and a laughing emoji (🤣). It does not target or insult any individual or group, nor does it convey hostility, mockery, or negativity. The tone is casual and humorous, typical of friendly banter among peers.",
        "toxicity_qwen_reason": "The phrase 'phố nhỏ biết gòi' uses distorted spelling ('gòi' for 'rồi') to mockingly imply basic knowledge, while the second part 'mà lạng sơn ở đâu thì lại hết biết🤣' ridicules the speaker for not knowing the geography of Lạng Sơn — a real place in Vietnam. The laughing emoji 🤣 emphasizes mockery. This creates a condescending tone, belittling someone’s knowledge in a demeaning way, which constitutes implicit toxicity.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Casual, playful comment about not knowing where Lạng Sơn is; no insults, hostility, or targeted negativity."
    },
    {
        "text": "dân chủ tự do như ông nghĩ thì xã hội loạn hết cả lên đấy, dù gì đây là nhiệm kì và tổng thống có chức quyền lớn nhất nên quyết định cùng vs quốc hội th",
        "category": "lgbtq",
        "id": "lgbtq_25241",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The text expresses a political disagreement by critiquing an opposing view of democracy and freedom, but it does not use profanity, personal insults, slurs, or hate speech. While the tone is dismissive and assertive, it remains within the bounds of respectful criticism and does not target any protected group or individual with hostility.",
        "toxicity_mistral_reason": "The comment implies that democracy and freedom ('dân chủ tự do') would lead to societal chaos ('xã hội loạn hết cả lên'), indirectly dismissing democratic values. While not overtly profane, the tone is dismissive and condescending toward differing political views, framing them as inherently destabilizing. This can be seen as toxic due to its polarized and negative generalization about democratic principles.",
        "toxicity_qwen_reason": "The comment expresses a political opinion about democracy, freedom, and social order, emphasizing the role of the president and congress in decision-making. While it disagrees with a viewpoint, it does so in a rational and respectful tone without personal attacks, slurs, mockery, or inflammatory language. It remains within the bounds of constructive political discourse.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Ý kiến tranh luận về chính trị, phê bình quan điểm nhưng không có chửi bới, xúc phạm cá nhân/nhóm hay từ ngữ thù hằn. Giọng điệu mạnh nhưng vẫn trong phạm vi tranh luận bình thường."
    },
    {
        "text": "mồi côi",
        "category": "region",
        "id": "region_25318",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "The phrase 'mồi côi' is a misspelling or phonetic approximation of 'mồ côi' (orphan), and in isolation, it lacks targeting, negative intent, or contextual cues indicating insult, mockery, or toxicity. It is a neutral term without inherent hostility or demeaning implications.",
        "toxicity_mistral_reason": "The term 'mồi côi' is a derogatory deformation of 'mồ côi' (orphan), used to mock or insult someone's family background. It carries a harsh and disrespectful tone, targeting a sensitive personal aspect (family status) in a demeaning way.",
        "toxicity_qwen_reason": "‘Mồi côi’ là biến thể phát âm lệch của ‘mồ côi’, mang sắc thái mỉa mai, thường dùng để chế giễu người mồ côi hoặc ám chỉ sự thiếu hụt tình cảm, hoàn cảnh khó khăn. Việc sử dụng dạng teen-code này trong bối cảnh không cảm thông có thể tạo nên sự xúc phạm, đặc biệt khi nhắm vào hoàn cảnh cá nhân. Tuy không có từ ngữ trực tiếp thô lỗ, nhưng đây là dạng châm biếm gián tiếp, mang tính xúc phạm cảm xúc, do đó được xem là độc hại.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Chỉ là từ (viết sai chính tả của 'mồ côi') mang nghĩa trung tính, không nhắm vào ai và không thể hiện xúc phạm hay kỳ thị."
    },
    {
        "text": "lúc chưa cho mượn thì nói ngon nói ngọt lúc mượn được rồi thì thuê bao không niên lạc được thì biết rồi",
        "category": "region",
        "id": "region_18919",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "Văn bản thể hiện sự thất vọng, phàn nàn về một tình huống cá nhân (người mượn đồ nói ngọt trước, sau khi mượn được thì không liên lạc được). Mặc dù có giọng điệu chỉ trích và bực bội, nhưng nội dung không chứa ngôn từ lăng mạ, xúc phạm trực tiếp, phân biệt đối xử, đe dọa hay ngôn từ thù địch. Đây là biểu hiện của sự bất mãn thông thường, không vượt quá ngưỡng được xác định là độc hại.",
        "toxicity_mistral_reason": "The comment expresses frustration and resentment toward someone who changed their attitude after borrowing something (implied money or an item). The phrase 'thuê bao không liên lạc được' (unreachable like a disconnected phone number) carries a sarcastic and accusatory tone, indirectly calling the person unreliable or dishonest. While not overtly profane, the underlying hostility and passive-aggressive implication make it toxic.",
        "toxicity_qwen_reason": "The text expresses frustration about someone who was friendly before borrowing but became unreachable afterward. While negative in sentiment, it does not contain profanity, insults, or hate speech. It conveys disappointment using common Vietnamese phrasing without targeting a group or using abusive language.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Chỉ là lời phàn nàn về việc vay mượn rồi không liên lạc được; không có chửi bới, miệt thị hay ngôn từ thù hằn."
    },
    {
        "text": "nhỏ lớn nghe cá rô cây đâu hiểu. giờ mới hiểu 🤣🤣🤣🤣🤣",
        "category": "region",
        "id": "region_3016",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "Văn bản đề cập đến thành ngữ 'cá rô cây' – một hình ảnh ẩn dụ về sự nghèo khó, nhưng ở đây người nói chỉ thể hiện sự hiểu biết muộn màng của bản thân ('nhỏ lớn nghe... đâu hiểu. giờ mới hiểu') chứ không nhắm mục tiêu chế giễu hay xúc phạm một cá nhân hay nhóm người cụ thể nào. Các emoji cười (🤣) có vẻ hướng vào việc người nói tự cười chính mình vì trước đây không hiểu, chứ không mang ý mỉa mai độc hại. Do đó, nội dung này không chứa ngôn ngữ thù địch, phân biệt đối xử hoặc có tính chất xúc phạm.",
        "toxicity_mistral_reason": "The phrase 'cá rô cây' is a regional stereotype implying poverty or lack of sophistication, often directed at people from Central Vietnam. The laughing emojis (🤣) amplify the mocking tone, suggesting ridicule rather than genuine humor or enlightenment. This reinforces a negative regional bias.",
        "toxicity_qwen_reason": "The phrase 'cá rô cây' is a slang term associated with poverty, often used to mock people from certain regions, particularly Central Vietnam. The speaker implies that someone ('nhỏ lớn') previously didn't understand this derogatory reference but now does, with laughter emojis (🤣) emphasizing mockery. This perpetuates regional stereotyping and ridicule, which constitutes indirect but culturally loaded toxic language.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Chỉ bày tỏ vừa hiểu nghĩa cụm từ “cá rô cây” kèm emoji cười; không nhắm vào cá nhân/nhóm hay hàm ý hạ thấp vùng miền hay ai cả."
    },
    {
        "text": "trong cmt toxic dữ v",
        "category": "lgbtq",
        "id": "lgbtq_15606",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "Câu này là một nhận xét chung về mức độ tiêu cực ('toxic') của các bình luận khác, không nhắm vào cá nhân hay nhóm cụ thể nào để xúc phạm, đe dọa hay phân biệt đối xử. Đây là một phát biểu mô tả, không chứa ngôn từ thù địch, mỉa mai hoặc độc hại.",
        "toxicity_mistral_reason": "The phrase 'trong cmt toxic dữ v' is a condensed form of 'trong comment toxic dữ vậy' (in the comments, so toxic). While the literal meaning refers to toxic comments in general, the use of 'dữ v' (a casual, slightly exaggerated tone) can carry an implicit mocking or dismissive attitude toward others' toxicity, potentially normalizing or trivializing toxic behavior. The tone leans toward sarcasm or playful negativity rather than constructive criticism.",
        "toxicity_qwen_reason": "Câu 'trong cmt toxic dữ v' sử dụng từ 'toxic dữ' – 'dữ' là tính từ thể hiện mức độ mạnh trong tiếng Việt (nghĩa là 'nặng', 'quá mức') – cho thấy sự chỉ trích, phê phán mang tính miệt thị hoặc chế giễu người khác là độc hại, ác ý. Câu này mang tính đánh giá tiêu cực về người khác trong ngữ cảnh thiếu thiện chí, thường xuất hiện trong tranh cãi mạng, góp phần tạo căng thẳng hoặc hạ thấp đối phương. Dù không có từ lăng mạ trực tiếp, nhưng việc gán ghép nhãn 'toxic' với sắc thái cường điệu ('dữ') tạo ra không khí công kích, do đó được xem là độc hại.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Chỉ nhận xét rằng phần bình luận ‘toxic’ (tiêu cực) mà không công kích cá nhân/nhóm, không chửi bới hay miệt thị; giọng điệu trung tính."
    },
    {
        "text": "🤓kệ đi,cs phải nc mình đâu mà lo",
        "category": "lgbtq",
        "id": "lgbtq_25585",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "The comment uses sarcasm (nerd emoji 🤓) and dismissive language ('kệ đi') to belittle concerns related to 'cs' (likely shorthand for 'Cộng sản' or communism), implying it's not worth worrying about in a mocking manner. This disrespects political ideologies and introduces hostility or negativity, fitting the definition of toxic language.",
        "toxicity_mistral_reason": "The comment uses casual, informal language ('kệ đi' meaning 'never mind' or 'let it be') and expresses a neutral or slightly dismissive opinion about a topic ('cs phải nc mình đâu mà lo' meaning 'why worry, it's not our country's issue'). There is no insult, mockery, or hostility toward any individual or group. The tone is relaxed and not emotionally negative.",
        "toxicity_qwen_reason": "The term 'cs' is a derogatory slang abbreviation for 'con sưt', a vulgar insult implying someone is a servant or inferior being. Combined with the dismissive tone ('kệ đi', 'phải nc mình đâu mà lo'), it shows disrespect and dehumanization, especially towards those outside an in-group. The use of the nerd emoji (🤓) may add mocking irony, enhancing the toxic tone.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu mang tính thờ ơ/dửng dưng (“kệ đi, có phải nước mình đâu mà lo”) nhưng không có lời lẽ xúc phạm, miệt thị hay đe dọa cá nhân/nhóm nào; không dùng từ thô tục."
    },
    {
        "text": "dân tộc vn mà kỳ thị thế à",
        "category": "region",
        "id": "region_16138",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The text makes a negative generalization about Vietnamese people as a whole by accusing them of discrimination, which introduces hostility and perpetuates stereotypes in a disrespectful tone.",
        "toxicity_mistral_reason": "The comment uses the phrase 'dân tộc vn mà kỳ thị thế à' which implies criticism of Vietnamese people for being discriminatory or prejudiced. The tone suggests disappointment or accusation, which can be seen as emotionally negative and potentially divisive, especially when addressing sensitive issues like discrimination within a national context. This can perpetuate negativity and hostility in the discussion.",
        "toxicity_qwen_reason": "Câu hỏi 'dân tộc vn mà kỳ thị thế à' thể hiện sự bất ngờ hoặc phản biện về hành động kỳ thị, mang tính chất chất vấn hoặc phản đối chứ không phải là lời kỳ thị hay ngôn ngữ độc hại. Không có từ ngữ miệt thị, chế giễu hay tấn công cá nhân, nhóm người. Tông giọng hướng đến phê phán hành vi kỳ thị, do đó được xem là phi độc hại.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Chỉ là lời phê bình việc kỳ thị, không dùng từ ngữ xúc phạm, đe doạ hay nhắm mục tiêu hạ nhục cá nhân/nhóm nào."
    },
    {
        "text": "tôi cứ tưởng thanh hoá mới bị. hoá ra nghệ an cũng bị à. trước sang cửa lò thấy khá ưng và vui với ng dân đó chứ",
        "category": "region",
        "id": "region_15595",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "The comment expresses personal surprise about a situation affecting Thanh Hóa and Nghệ An provinces, but does not specify what 'bị' refers to, and it includes a positive recollection of people in Cửa Lò. There is no use of slurs, insults, mockery, or hostile language, and the tone is conversational and non-aggressive.",
        "toxicity_mistral_reason": "The comment implies a negative stereotype about people from Thanh Hóa and Nghệ An, suggesting they are associated with something undesirable ('bị'). The phrase 'trước sang cửa lò thấy khá ưng và vui với ng dân đó chứ' subtly reinforces a regional bias by contrasting the speaker's previous positive impression with a now-negative one, which can be seen as demeaning or mocking toward the people of these regions.",
        "toxicity_qwen_reason": "The phrase implies a negative generalization about people from Nghệ An by suggesting they are 'bị' (affected/suffering from something bad), which carries a derogatory undertone. Combined with the contrast to Thanh Hóa (another region often stereotyped), it reinforces regional bias. The comment uses implied inferiority, contributing to social divisiveness and stereotyping, which aligns with toxic language in cultural context.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Nội dung trung tính/ tích cực, không có từ ngữ miệt thị hay xúc phạm vùng miền; còn khen trải nghiệm ở Cửa Lò và người dân địa phương."
    },
    {
        "text": "có lẽ nhiều bạn ko biết người tạo nên cái trend md là người bắc xong các bạn miền nam vô bênh xong các bạn miền bắc vô nói lại và giờ thì tầy wầy",
        "category": "region",
        "id": "region_23739",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "The text neutrally describes a situation where regional groups (Northern and Southern Vietnamese) are involved in an online debate about a trend, without using derogatory terms, insults, or hate speech. The tone is observational and informative, lacking hostility or emotional negativity.",
        "toxicity_mistral_reason": "The comment uses regional labels ('người bắc', 'miền nam', 'miền bắc') in a way that frames a conflict between groups, implying blame and division. The phrase 'tầy wầy' (chaotic/messy) further escalates the negativity, suggesting hostility between regions rather than neutral or constructive discussion.",
        "toxicity_qwen_reason": "The text uses 'người bắc', 'miền nam', 'miền bắc' to provoke regional division and implies unnecessary conflict between people from different regions. The phrasing carries a mocking tone about regional loyalty ('các bạn miền nam vô bênh', 'các bạn miền bắc vô nói lại') and ends with 'tầy wầy' to exaggerate chaos, encouraging in-group bias and regional stereotyping, which is a form of indirect toxicity in Vietnamese online culture.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Bình luận mô tả diễn biến tranh luận giữa miền Bắc/miền Nam mà không dùng từ ngữ miệt thị, xúc phạm hay hàm ý phân biệt. ‘tầy wầy’ chỉ sự lộn xộn, không nhắm vào cá nhân/nhóm nào."
    },
    {
        "text": "nguyễn văn hoàng anh gu b nè xăng ơi",
        "category": "lgbtq",
        "id": "lgbtq_6767",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The text is an informal, casual comment that does not contain any harsh, rude, or disrespectful language. It lacks clear insults, profanity, or negative targeting of individuals or groups, and there is no evidence of mockery, sarcasm, or toxic intent in its tone or cultural context.",
        "toxicity_mistral_reason": "The text uses 'gu b' (a deformation of 'gay' or 'gấu' in LGBTQ+ slang) and 'xăng' (a phonetic approximation of 'sex' or 'sinh hoạt tình dục') in a mocking or derogatory manner. This implies a negative or teasing tone toward the person's sexual orientation or identity, which qualifies as toxic language.",
        "toxicity_qwen_reason": "The text appears to be a casual, informal address using slang or phonetic spelling ('gu b nè xăng' likely meaning 'gửi bạn nè anh' or 'gửi bạn nè sang'), possibly directed to someone named Nguyễn Văn Hoàng Anh. There is no evident insult, mockery, or harmful intent. It does not contain derogatory terms, slurs, or toxic implications based on regional, religious, or personal characteristics. The tone seems neutral or friendly, albeit in teen-code style.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu nói dùng teen-code thân mật (“gu b nè”, gọi tên “xăng ơi”), chỉ giới thiệu gu/kiểu người cho bạn; không có chửi bới, mỉa mai hay công kích cá nhân/nhóm nào."
    },
    {
        "text": "buồn cho 1 thế hệ trẻ bây giờ",
        "category": "region",
        "id": "region_27063",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "Câu nói mang tính phán xét, khái quát hóa tiêu cực cả một thế hệ trẻ, tạo ra sự chia rẽ và định kiến dựa trên tuổi tác, thể hiện sự chê bai và thất vọng một cách thiếu xây dựng.",
        "toxicity_mistral_reason": "The comment expresses sadness or concern ('buồn') for the current younger generation, but it does not contain insults, profanity, or targeted hostility. The tone is negative but not toxic, as it reflects a general sentiment rather than an attack on individuals or groups.",
        "toxicity_qwen_reason": "Câu nói thể hiện sự tiếc nuối hoặc lo lắng về một thế hệ trẻ, nhưng không có nội dung lăng mạ, chế giễu, hay nhắm vào đối tượng cụ thể. Dù mang sắc thái tiêu cực, nó thuộc phạm vi bày tỏ quan điểm mang tính tổng quát và không sử dụng ngôn ngữ độc hại, tục tĩu hay phân biệt.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Chỉ bày tỏ sự thất vọng/buồn trước tình trạng của giới trẻ, không dùng từ ngữ miệt thị, xúc phạm hay công kích cá nhân/nhóm cụ thể; giọng điệu trung tính, không có lời lẽ thù ghét hoặc tục tĩu."
    },
    {
        "text": "cháu get kệ mẹ chúng nó",
        "category": "region",
        "id": "region_32805",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The text contains vulgar language ('kệ mẹ') and expresses hatred ('ghét'), which is disrespectful and hostile, making it toxic.",
        "toxicity_mistral_reason": "The phrase 'get kệ mẹ chúng nó' is a highly disrespectful and aggressive expression. 'Get kệ' is a slang deformation of 'kệ' (to ignore), and 'mẹ chúng nó' is a vulgar and offensive way to refer to someone's mother, often used in confrontational or insulting contexts. The tone is hostile and demeaning, targeting others in a toxic manner.",
        "toxicity_qwen_reason": "The phrase 'cháu get kệ mẹ chúng nó' uses teen-code and slang ('get kệ' for 'giữ kệ', i.e., 'doesn’t care'), expressing indifference in a casual, colloquial tone. While informal and slightly rebellious, it does not contain insults, profanity, or targeting toward any individual or group. The sentiment is dismissive but not hostile or disrespectful in a toxic sense.",
        "toxicity": "TOXIC",
        "toxicity_gpt_reason": "Dùng từ tục ‘kệ mẹ’ và thái độ thù ghét (‘ghét’) nhắm tới ‘chúng nó’ mang tính miệt thị, thể hiện sự thù địch và xúc phạm."
    },
    {
        "text": "đâu có hay ho gì đâu mà mấy ngày nay cứ đăng những bài như thế này.làm hỏng 1 thế hệ.ảnh hưởng đến trẻ nhỏ",
        "category": "lgbtq",
        "id": "lgbtq_6139",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The text criticizes online content for potentially harming children and a generation, but it does so without profanity, personal attacks, or discriminatory language. The tone is concerned and disapproving but not abusive or disrespectful.",
        "toxicity_mistral_reason": "The comment expresses strong disapproval and criticism in a harsh, emotionally negative tone ('đâu có hay ho gì đâu', 'làm hỏng 1 thế hệ', 'ảnh hưởng đến trẻ nhỏ'). While it does not use profanity or slurs, the language is accusatory and implies harm to society, particularly children, which introduces hostility and negativity into the discussion. The tone is disrespectful and dismissive of others' content.",
        "toxicity_qwen_reason": "The text expresses disapproval of content being shared, claiming it negatively affects youth, but does so without personal attacks, profanity, or derogatory language. It reflects a critical opinion about social influence, likely in a media or educational context, and maintains a general tone of concern rather than hostility or mockery.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Chỉ là phê bình nội dung gây hại cho trẻ em, giọng điệu gay gắt nhưng không chứa xúc phạm, chửi bậy hay công kích cá nhân/nhóm."
    },
    {
        "text": "bầu dục hả",
        "category": "lgbtq",
        "id": "lgbtq_27525",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "The term 'bầu dục' (kidneys) is used here not in a literal sense but as a slang term to mock someone's physical appearance, implying their face or body shape resembles an unattractive organ. The questioning tone 'hả' adds a layer of sarcasm or disbelief, making the comment demeaning and disrespectful.",
        "toxicity_mistral_reason": "The phrase 'bầu dục hả' literally refers to 'pig's kidney' as food, a common dish in Vietnamese cuisine. There is no evident toxic intent, insult, or negative connotation toward any individual or group. It is a neutral, casual comment about food.",
        "toxicity_qwen_reason": "The phrase 'bầu dục' is a phonetic distortion of 'bầu dục' (testicles), used here as a vulgar, mocking term. In context, it's likely a derogatory pun on 'bầu' (which can mean 'pregnant' or refer to someone important, e.g. 'bầu Kiên'), implying disrespect or crude humor. The lack of context doesn't negate the use of biologically crude slang in a teasing or insulting tone, which aligns with toxic speech through implicit mockery.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Chỉ là câu hỏi ngắn “bầu dục hả” (có thể hỏi về món bầu dục/thận hoặc hình bầu dục). Không nhắm vào ai, không có xúc phạm hay giọng điệu tiêu cực."
    },
    {
        "text": "rồi đứa nào mang ku giã",
        "category": "lgbtq",
        "id": "lgbtq_1840",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "Văn bản sử dụng từ 'đứa' mang tính xúc phạm và đề cập đến hành động bạo lực ('giã'), tạo ra giọng điệu thù địch, cáo buộc và khuyến khích tiêu cực, vi phạm tiêu chuẩn về ngôn ngữ độc hại.",
        "toxicity_mistral_reason": "The phrase 'mang ku giã' is a derogatory and vulgar slang term targeting a person (often implying stupidity or worthlessness). The tone is dismissive and insulting, making it toxic.",
        "toxicity_qwen_reason": "The phrase 'rồi đứa nào mang ku giã' uses informal, colloquial language and appears to be a playful or casual inquiry about someone named 'ku giã' (a nickname, possibly phonetic or slang). There is no evident hostility, insult, or discriminatory intent. Without further context suggesting mockery or negative connotation, it remains neutral and non-offensive.",
        "toxicity": "TOXIC",
        "toxicity_gpt_reason": "Chứa từ lóng “ku” (chỉ bộ phận sinh dục nam) và cụm “đứa nào” mang tính miệt thị; câu mang nội dung thô tục/vulgar, tạo sắc thái xúc phạm dù không nhắm đích danh cá nhân."
    },
    {
        "text": "việt nam sau bây giờ toàn quay clip như thế này chứ, hư hại hết xã hội con cái trẻ nhỏ học đòi theo trả trách",
        "category": "lgbtq",
        "id": "lgbtq_12332",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "Bình luận thể hiện sự chỉ trích và lo ngại về ảnh hưởng của một xu hướng nội dung (clip) đối với xã hội và trẻ em. Mặc dù có giọng điệu tiêu cực và phàn nàn, nó không nhắm mục tiêu xúc phạm cá nhân hay nhóm cụ thể nào, không sử dụng ngôn từ lăng mạ, đe dọa, hoặc ngôn từ kỳ thị. Đây là một lời phê bình mang tính xã hội hơn là ngôn từ độc hại.",
        "toxicity_mistral_reason": "The comment expresses strong negativity and criticism toward a societal trend (filming/vlogging), using emotionally charged language ('hư hại hết xã hội', 'trẻ nhỏ học đòi'). While not directly insulting an individual or group, the tone is harsh, blaming, and overly generalized, contributing to hostility and negativity in the discussion. The phrase 'trả trách' (likely a typo for 'trách nhiệm') also implies blame in a dismissive manner.",
        "toxicity_qwen_reason": "The statement uses hyperbolic and emotionally charged language ('hư hại hết xã hội', 'con cái trẻ nhỏ học đòi') to harshly condemn a generation's behavior without constructive critique. It generalizes negatively about youth and social media content, implying moral decay and blame on society, which creates a hostile and divisive tone.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Phàn nàn về xu hướng quay clip và ảnh hưởng xấu đến xã hội, không nhắm vào cá nhân hay nhóm nào, không có xúc phạm hay từ ngữ thô tục; chỉ là nhận xét tiêu cực/than phiền."
    },
    {
        "text": "team ko hỉu parky là j",
        "category": "region",
        "id": "region_26806",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "Đây là một câu hỏi thắc mắc về nghĩa của từ 'parky'. Người dùng không sử dụng từ này để chế nhạo hay xúc phạm bất kỳ cá nhân hay nhóm nào. Câu hỏi có tính chất tìm hiểu thông tin, không thể hiện ý định độc hại, thù địch hay mang sắc thái tiêu cực.",
        "toxicity_mistral_reason": "The comment is a neutral question asking for clarification about the meaning of 'parky'. There is no mockery, insult, or negative intent toward any individual or group. The term 'parky' itself is slang, but the context here is purely informational.",
        "toxicity_qwen_reason": "The term 'parky' is a derogatory deformation of 'Bắc Kỳ' (Northern Vietnam), often used mockingly. The phrase 'team ko hỉu parky là j' implies a dismissive or ridiculing tone toward people who may not recognize this slur, reinforcing negative regional stereotyping. The use of 'parky' in such contexts perpetuates regional discrimination, which is culturally sensitive and toxic in Vietnamese social discourse.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu hỏi trung lập, chỉ hỏi nghĩa của “parky” (một từ có thể mang tính miệt thị) mà không nhằm công kích hay chế giễu ai."
    },
    {
        "text": "nam nam thì cũng bthg mà, bno chửi dữ vậy t tưởng ae ruột lấy nhau",
        "category": "lgbtq",
        "id": "lgbtq_27866",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "The text states that same-sex relationships ('nam nam') are normal ('bthg'), and expresses confusion about why people are arguing harshly ('chửi dữ vậy'). The phrase 't tưởng ae ruột lấy nhau' (I thought they were siblings marrying each other) appears to be a mistaken assumption or a hyperbolic comparison to explain the intensity of the argument, not a direct insult or hate speech targeting LGBTQ+ individuals. The overall tone is observational and questioning, not hostile, demeaning, or promoting discrimination.",
        "toxicity_mistral_reason": "The comment uses the phrase 'bno chửi dữ vậy' (you all curse so harshly), which implies that the speaker is accusing others of using toxic or aggressive language. While the tone may seem like a complaint about toxicity, the phrasing itself carries a negative and confrontational undertone, especially when combined with 't tưởng ae ruột lấy nhau' (I thought you were siblings), which can be interpreted as sarcastic or dismissive. This escalates the negativity in the interaction.",
        "toxicity_qwen_reason": "The text uses sarcasm and mocking tone to belittle same-sex relationships ('nam nam thì cũng bthg mà') while exaggerating disapproval with 'bno chửi dữ vậy t tưởng ae ruột lấy nhau', implying such relationships are unnatural or incestuous. The phrase 'ae ruột' (blood-related siblings) carries a strong negative connotation, suggesting taboo, and reflects derogatory attitudes toward LGBTQ+ individuals, constituting implicit homophobia.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Tone is casual and supportive of same-sex relationships (“nam nam thì cũng bình thường”). The mention of “ae ruột lấy nhau” is rhetorical to highlight others’ overreaction, not to insult a group. No direct slurs, threats, or derogatory targeting."
    },
    {
        "text": "cho mấy thk bthg à🥰",
        "category": "lgbtq",
        "id": "lgbtq_17605",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The term 'thk' is a derogatory slang shorthand for 'thằng' (guy/dude), often used disrespectfully to refer to people. The phrase 'mấy thk bthg' (several ordinary guys) dismisses a group as mundane or inferior in a belittling tone, and the emoji 🥰 is likely used sarcastically to mock rather than express genuine affection, contributing to a demeaning and disrespectful message.",
        "toxicity_mistral_reason": "The comment uses a friendly and affectionate tone ('cho mấy thk bthg à' - 'for the normal/good commenters') with a heart-eyed emoji (🥰), expressing warmth and appreciation. There is no insult, mockery, or negative intent toward any individual or group.",
        "toxicity_qwen_reason": "The text 'cho mấy thk bthg à🥰' is a casual, affectionate expression meaning 'giving to a few normal people, huh? 🥰'. It uses common abbreviations ('thk' for 'thằng', 'bthg' for 'bình thường') and a heart-eyed emoji, indicating a friendly or teasing tone. There is no target of mockery, no derogatory intent, and no toxic language. The tone is light-hearted and non-offensive in common Vietnamese internet usage.",
        "toxicity": "TOXIC",
        "toxicity_gpt_reason": "Dùng teen-code “thk” = “thằng” để gọi nhóm người (“mấy thằng”) mang sắc thái khinh miệt/thiếu tôn trọng; câu hỏi mang tính hạ thấp dù có emoji dễ thương."
    },
    {
        "text": "neu no chuan nam thi chuân đưng đô loi cho ai làm ãnh huong.kg ai sông cho ai dc..tư ho chon cach ho song...kg ngoai tinh ai ep ...😂",
        "category": "lgbtq",
        "id": "lgbtq_24153",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "Văn bản thảo luận về việc không đổ lỗi cho người khác về lựa chọn cá nhân (như giới tính hoặc cách sống), nhấn mạnh trách nhiệm và tự do cá nhân mà không sử dụng ngôn ngữ xúc phạm, đe dọa hoặc phân biệt đối xử. Emoji 😂 có thể tạo thêm giọng điệu hài hước nhưng không nhắm mục tiêu chế giễu hoặc gây hại cho cá nhân hay nhóm nào.",
        "toxicity_mistral_reason": "Bình luận sử dụng ngôn từ thiếu tôn trọng ('chuân đưng đô', 'kg', 'ãnh huong') và thể hiện thái độ coi thường quyền tự do lựa chọn của người khác ('kg ai sông cho ai dc', 'kg ngoai tinh ai ép'). Emoji 😂 còn mang tính chê bai, làm tăng tính tiêu cực của thông điệp.",
        "toxicity_qwen_reason": "The text uses distorted spelling and slang to express a dismissive and mocking tone. Phrases like 'kg ai sông cho ai dc' (no one lives for anyone) and 'tư ho chon cach ho song' (everyone chooses their own way of living) appear neutral but are framed in a context of justifying questionable behavior (likely infidelity, implied by 'kg ngoai tinh ai ep' – 'no one forces you to cheat'). The laughing emoji '😂' at the end trivializes serious matters like betrayal, indicating insensitivity and mockery toward moral standards or emotional harm, which constitutes emotionally dismissive and toxic communication.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Nội dung chỉ tranh luận/khuyên không đổ lỗi, nhấn mạnh lựa chọn cá nhân; dùng từ xưng hô suồng sã và emoji cười hơi mỉa nhưng không có chửi bới, xúc phạm, đe doạ hay nhắm tới cá nhân/nhóm nào."
    },
    {
        "text": "a trai mtay nói hay lắm",
        "category": "region",
        "id": "region_2865",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The term 'mtay' is a common internet slang abbreviation for 'mất tay,' implying clumsiness, lack of skill, or incompetence. The phrase 'nói hay lắm' (speak very well) is likely used sarcastically in this context. Therefore, the comment is a backhanded compliment or mockery, conveying negativity and disrespect towards the person's ability to speak.",
        "toxicity_mistral_reason": "The phrase 'a trai mtay nói hay lắm' translates to 'this guy from the West/Southwest speaks well.' While 'mtay' (short for 'miền Tây') can sometimes be used in a teasing or regional context, here it is simply describing someone's origin and praising their speaking ability. There is no mockery, insult, or negative implication toward the individual or their region.",
        "toxicity_qwen_reason": "The text 'a trai mtay nói hay lắm' appears to be a phonetic or shorthand way of writing 'anh trai miền Tây nói hay lắm' (a man from the Mekong Delta speaks very well). It expresses a compliment about someone's speaking ability, likely referring to their eloquence or accent, without any negative or mocking tone. While 'mtay' is an informal abbreviation, it is not inherently derogatory in this context. There is no insult, sarcasm, or demeaning intent detected.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu khen ngợi “anh trai miền Tây nói hay lắm” mang tính tích cực, không có xúc phạm, miệt thị hay thù ghét."
    },
    {
        "text": "cũng ra gì và rất lỳ",
        "category": "region",
        "id": "region_13793",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "Câu nói mang tính chỉ trích và miệt thị cá nhân. 'Cũng ra gì' hàm ý chê bai, phủ nhận giá trị của đối tượng, và 'rất lỳ' là lời buộc tội tính cách tiêu cực (cứng đầu, khó bảo). Tổng thể câu có giọng điệu khinh thường, công kích và gây tổn thương, dù không dùng từ ngữ thô tục.",
        "toxicity_mistral_reason": "The phrase 'cũng ra gì' implies insignificance or worthlessness, while 'rất lỳ' (stubborn/unreasonable in a negative sense) is a direct insult. The combination conveys disrespect and mockery toward the target, making it toxic.",
        "toxicity_qwen_reason": "The phrase 'cũng ra gì và rất lỳ' literally means 'not bad and quite tough/persistent'. It is often used informally to describe someone or something as decent or resilient, possibly in a playful or teasing tone, but does not contain insults, slurs, or derogatory implications. Without additional context targeting a person or group with negativity, this expression remains within the realm of colloquial, non-toxic banter.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu nói trung tính/khá tích cực, không chứa chửi tục hay công kích. “cũng ra gì” mang nghĩa khen nhẹ, “rất lỳ” mô tả lì lợm/kiên gan, không nhắm hạ nhục cá nhân hay nhóm nào."
    },
    {
        "text": "ông là người thanh hóa mà lị",
        "category": "region",
        "id": "region_17710",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The text is a straightforward statement identifying someone's origin from Thanh Hoa province, using the colloquial particle 'mà lị' which is common in casual Northern Vietnamese speech. It lacks explicit insults, derogatory terms, or clear intent to mock or demean based on regional identity. Without additional context or implicit signals of hostility, it does not meet the criteria for toxicity.",
        "toxicity_mistral_reason": "The comment uses regional identity ('người Thanh Hóa') in a potentially derogatory or mocking manner, depending on context. While not overtly aggressive, it can carry implicit bias or stereotypes (e.g., associations with phrases like 'rau má nương nương' or 'ăn rau má, phá đường tàu'). Without additional context, the tone risks perpetuating regional discrimination.",
        "toxicity_qwen_reason": "The statement 'ông là người thanh hóa mà lị' is a declarative sentence identifying someone's origin as Thanh Hóa. While 'lị' is a colloquial and slightly rustic particle, common in Northern Vietnamese dialects, it does not carry inherently derogatory or mocking intent here. Without additional context such as sarcasm, stereotypes (e.g., 'ăn rau má'), or negative framing, this phrase alone does not express hostility or regional bias. It remains neutral in tone and intent.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Chỉ nêu xuất thân (Thanh Hóa) với ngữ đệm “mà lị” mang tính nhấn mạnh/than thở nhẹ, không kèm theo chê bai, định kiến hay lời lẽ xúc phạm."
    },
    {
        "text": "trước làm bên cty gỗ a thanh hóa mượn 1tr tiền khám bệnh xong bữa sau nghĩ việc đi đâu luôn",
        "category": "region",
        "id": "region_17456",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "The text recounts a personal anecdote about a coworker from Thanh Hóa who borrowed money and then quit. While it describes a negative action (borrowing money and leaving), the language is neutral and factual, not using any derogatory slurs, stereotypes, or hostile language targeted at the person's origin. It lacks the mocking tone or coded regional insults present in toxic examples.",
        "toxicity_mistral_reason": "The text describes a personal experience involving borrowing money and quitting a job without any insults, profanity, or derogatory language. It does not target any individual or group negatively, nor does it contain sarcasm, mockery, or implicit hostility. The tone is neutral and factual.",
        "toxicity_qwen_reason": "Câu nói mang hàm ý tiêu cực, lợi dụng thành kiến vùng miền với cụm 'cty gỗ a thanh hóa' – chơi chữ từ 'con đĩ trẻ hóa', một cách gọi miệt thị người Thanh Hóa. Việc liên kết với việc 'mượn tiền khám bệnh rồi biến mất' càng làm tăng tính xúc phạm, khơi gợi định kiến về sự thiếu trung thực. Ngữ cảnh mang tính bôi nhọ mang màu sắc kỳ thị địa phương.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu kể lại sự việc cá nhân, không dùng từ miệt thị, chửi bới hay công kích. Việc nhắc đến ‘Thanh Hóa’ chỉ là mô tả xuất xứ người đó, không khái quát hay xúc phạm cả nhóm."
    },
    {
        "text": "nhật kí có móc!",
        "category": "region",
        "id": "region_8468",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "Cụm từ 'nhật kí có móc!' là một cách nói dí dỏm hoặc mô tả đơn giản về một cuốn nhật ký có gắn móc treo. Nó không chứa ngôn ngữ xúc phạm, công kích, phân biệt đối xử, hay bất kỳ yếu tố độc hại nào nhắm vào cá nhân hoặc nhóm nào. Giọng điệu trung lập hoặc hài hước nhẹ nhàng, không có dấu hiệu của sự mỉa mai, chế nhạo, hay thù địch.",
        "toxicity_mistral_reason": "The phrase 'nhật kí có móc' is a derogatory slang term targeting LGBTQ+ individuals, implying that someone is 'hooked' or 'bent' (a play on words suggesting non-heteronormative behavior). This carries a mocking and demeaning tone toward a specific group.",
        "toxicity_qwen_reason": "The phrase 'nhật kí có móc' is a phonetic and slang distortion of 'nhàm chán, khốn nạn, sống mũi tẹt' – a derogatory stereotype targeting people with flat noses, often used to mock or insult individuals, particularly in a regional or ethnic context. The use of wordplay with implied negative traits makes it a form of indirect, culturally loaded insult.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu cảm thán ngắn, không nhắm vào cá nhân/nhóm nào và không dùng từ ngữ xúc phạm; “móc” ở đây mơ hồ, không thể hiện công kích hay thù ghét."
    },
    {
        "text": "thuê ng sinh bạn!!!",
        "category": "lgbtq",
        "id": "lgbtq_32484",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The text 'thuê ng sinh bạn!!!' appears to be a casual suggestion to hire a student, using abbreviations like 'ng sinh' for 'sinh viên' (student) and addressing 'bạn' (friend) in a friendly tone. It lacks insults, profanity, mockery, or any targeting of individuals or groups, and does not convey hostility or negativity based on cultural context.",
        "toxicity_mistral_reason": "The phrase 'thuê ng sinh bạn' is a deformation of 'thuê người yêu' (hire a boyfriend/girlfriend) but uses 'ng' (short for 'người') and 'sinh' (short for 'sinh viên' or student, but also sounds like 'sinh' in 'sinh đẻ'—birth). The tone implies mockery or objectification of relationships, reducing them to a transactional or superficial level, which can be seen as disrespectful or demeaning.",
        "toxicity_qwen_reason": "The text 'thuê ng sinh bạn!!!' is a phonetic or slangy way of writing 'thử nghĩ xem bạn!!!' (try to think, dude!). It appears to be an exclamation encouraging someone to think, possibly in a playful or emphatic tone. While informal and using teen-code spelling, it does not contain insults, slurs, mockery, or any form of toxic intent. There is no indication of targeting someone negatively or using derogatory implications. The tone is energetic but not hostile.",
        "toxicity": "TOXIC",
        "toxicity_gpt_reason": "Câu mỉa mai nhắm trực tiếp vào “bạn”, hàm ý xúc phạm nguồn gốc/sinh thành (ám chỉ phải thuê người sinh), mang tính chế giễu và công kích dù không dùng từ thô tục."
    },
    {
        "text": "minh viet má",
        "category": "lgbtq",
        "id": "lgbtq_16301",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "Cụm từ 'minh viet má' không rõ nghĩa, có thể là lỗi đánh máy hoặc cách viết tắt/slang vô thưởng vô phạt. Không chứa ngôn ngữ xúc phạm, không nhắm mục tiêu cá nhân hay nhóm nào, không có ngữ cảnh cho thấy ý định chế giễu, kỳ thị hay thù địch.",
        "toxicity_mistral_reason": "The phrase 'minh viet má' is a phonetic deformation of 'Mình Việt Nam' but uses 'má' (a Southern Vietnamese term for 'mẹ' or 'mom'), which, in this context, carries a mocking or derogatory tone. It subtly implies regional bias or ridicule toward Vietnamese identity or language, especially when used sarcastically or dismissively.",
        "toxicity_qwen_reason": "‘Minh viet má’ is a phonetic distortion of ‘Minh Viết Mẹ’, which is a vulgar expression using profanity (‘mẹ’ as a swearword). It shows disrespect and uses crude language, fitting the definition of toxic due to its profane and aggressive tone.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Có thể là lỗi gõ của “mình viết mà” hoặc dùng ‘má’ như cảm thán nhẹ. Không nhắm vào ai, không có xúc phạm hay thù ghét."
    },
    {
        "text": "đúng là ngôn ngữ xì trum!",
        "category": "region",
        "id": "region_4736",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "Bình luận 'đúng là ngôn ngữ xì trum!' là một nhận xét châm biếm nhẹ về một phong cách ngôn ngữ (có thể teen code, tiếng lóng) bị coi là ngây ngô hoặc trẻ con. Tuy có giọng điệu mỉa mai, nó không nhắm vào cá nhân hay nhóm cụ thể để xúc phạm, đe dọa, hay phân biệt đối xử, và không sử dụng ngôn từ thô tục hoặc thù hận. Đây là một lời chỉ trích nhẹ về hiện tượng ngôn ngữ, không vượt quá ngưỡng độc hại.",
        "toxicity_mistral_reason": "Cụm từ 'ngôn ngữ xì trum' là một cách diễn đạt hài hước, so sánh ngôn ngữ (thường là trẻ con hoặc cách nói ngây ngô) với nhân vật Xì Trum (Smurfs) trong phim hoạt hình. Không có ý chế giễu, xúc phạm hay mang tính công kích cá nhân/nhóm nào. Ngữ cảnh này mang tính vui vẻ, không chứa yếu tố toxic.",
        "toxicity_qwen_reason": "‘Ngôn ngữ xì trum’ là cách nói ẩn dụ mang tính chế giễu, ám chỉ ai đó nói chuyện khó hiểu, ngọng nghịu hoặc mang sắc thái châm biếm người thiểu số, vùng sâu vùng xa, hoặc người khuyết tật. Cách dùng này dựa trên hình ảnh nhân vật hoạt hình Xì Trum với ngôn ngữ riêng, tạo cảm giác kỳ thị và hạ thấp người khác, do đó mang tính độc hại.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Chỉ là cách nói đùa/ẩn dụ về kiểu viết khó hiểu (“ngôn ngữ xì trum”), không có xúc phạm nặng, không nhắm vào cá nhân hoặc nhóm nhạy cảm, không dùng từ tục."
    },
    {
        "text": "sadboi hướng ngoại thế nào là rác rưởi vậy ạ ??",
        "category": "lgbtq",
        "id": "lgbtq_9575",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "The text is a question directed at 'sadboi' seeking clarification on why extroversion is considered rubbish. While 'rác rưởi' is a harsh term, it is used in the context of questioning a previous statement rather than as a direct insult or attack. The polite marker 'ạ' indicates a respectful tone, and there is no evidence of targeting protected groups, hate speech, or malicious intent.",
        "toxicity_mistral_reason": "The phrase 'hướng ngoại thế nào là rác rưởi' uses the derogatory term 'rác rưởi' (trash/garbage) to describe extroverted people ('hướng ngoại'). This is a blanket insult targeting a personality trait, implying negativity or disdain toward individuals who are outgoing. The tone is dismissive and demeaning, fitting the definition of toxic language.",
        "toxicity_qwen_reason": "The term 'rác rưởi' (trash, junk) is a derogatory slur implying worthlessness or disgust. When directed at a person or identity (here, possibly mocking someone associated with 'sadboi' or 'hướng ngoại'), it becomes a personal attack. Combined with sarcastic phrasing ('thế nào là... vậy ạ??'), the tone is mocking and contemptuous, showing disrespect under the guise of questioning.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu hỏi mang giọng điệu lịch sự, dùng từ “rác rưởi” để chất vấn/đòi giải thích nhận định trước đó về “sadboi hướng ngoại”, không nhằm công kích hay hạ nhục đối tượng."
    },
    {
        "text": "thôi đi sao mọi người cứ phải parky,namky sao chỉ vì parky với cả namky mọi người chửi nhau,mấy từ đó có giúp mọi người cgi ko thì bao giờ mới hết mọi người thế có ai tự tin về vùng miền của tốt ko",
        "category": "region",
        "id": "region_25882",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "Bình luận này phê phán việc sử dụng các từ như 'parky' (biến thể của 'Bắc Kỳ') và 'namky' ('Nam Kỳ') để chửi nhau và chia rẽ. Người viết đặt câu hỏi về tính hữu ích của việc này và kêu gọi mọi người ngừng lại, đồng thời khuyến khích sự tự tin về quê hương mình. Mặc dù đề cập đến các thuật ngữ nhạy cảm, mục đích và thông điệp chính là phản đối sự kỳ thị vùng miền và hướng tới sự đoàn kết, mang tính xây dựng.",
        "toxicity_mistral_reason": "The text contains derogatory terms 'parky' and 'namky' which are slurs for Northern and Southern Vietnamese, respectively. It also implies that people from these regions are constantly arguing and using offensive language against each other. The text perpetuates regional stereotypes and promotes a negative and hostile atmosphere.",
        "toxicity_qwen_reason": "The text expresses frustration and criticism towards the use of regional slurs like 'parky' (derogatory for 'Bắc Kỳ') and 'namky' (for 'Nam Kỳ'), but does so to question and discourage such labeling. The speaker is calling for unity and self-reflection, asking whether these terms contribute anything positive and when the infighting will end. The tone is reflective and concerned, not hostile or mocking, and aims to critique toxic behavior rather than engage in it.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Người viết phê phán việc dùng các từ mang tính miệt thị vùng miền (“parky”, “namky”) và kêu gọi ngừng chửi nhau; không nhắm công kích ai, không dùng lời lẽ xúc phạm mà khuyên mọi người bỏ cách gọi gây chia rẽ."
    },
    {
        "text": "bạn k hiểu luật à muon den luật pháp thì nợ phải có giấy tờ k co giật to vay mượn thì cong an gq kiểu gi",
        "category": "region",
        "id": "region_19527",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The text directly challenges the recipient's understanding of legal procedures regarding debts and police involvement. While the tone is slightly confrontational ('bạn k hiểu luật à'), the content focuses on explaining a legal point (debts require paperwork for police resolution) and does not contain insults, slurs, profanity, or target any protected group. The frustration is directed at the argument, not the person's inherent attributes.",
        "toxicity_mistral_reason": "The text contains a threat and implies legal action, which is intimidating and hostile. The phrase 'cong an gq' refers to the police in a derogatory manner, adding to the toxicity.",
        "toxicity_qwen_reason": "The text expresses frustration regarding debt collection and legal procedures, emphasizing the need for documentation in financial disputes. While the tone is assertive and uses informal phrasing (e.g., 'muon den', 'giật to'), it does not contain personal attacks, slurs, or targeted insults. It raises a procedural concern about law enforcement handling of debt without outright hostility or profanity, falling within acceptable bounds of critical but non-abusive discourse.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Phê bình về hiểu biết luật pháp, giọng điệu thẳng nhưng không có chửi tục, đe dọa hay miệt thị cá nhân/nhóm."
    },
    {
        "text": "sọ quả cam",
        "category": "lgbtq",
        "id": "lgbtq_15206",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "Cụm từ 'sọ quả cam' có thể hiểu là một cách nói hài hước, ví von cái đầu giống quả cam, nhưng không chứa ngôn từ xúc phạm, thô tục, hay nhắm vào bất kỳ cá nhân/nhóm cụ thể nào. Trong văn hóa Việt, đây không phải là lời lẽ độc hại, mà chỉ mang tính chế giễu nhẹ nhàng, vui đùa nếu có. Không có yếu tố kỳ thị, đe dọa, hay gây thù ghét rõ ràng.",
        "toxicity_mistral_reason": "The phrase 'sọ quả cam' is a playful, informal way to describe someone with a round head (resembling a cam fruit). While it comments on appearance, it does not carry strong negative connotations, insults, or mockery. It is often used in a lighthearted or teasing manner among friends without intent to demean or offend.",
        "toxicity_qwen_reason": "The phrase 'sọ quả cam' is a phonetic pun in Vietnamese where 'sọ' (skull) and 'quả cam' (orange) sound similar to 'xỏ quả cam', which can be interpreted as a vulgar or sexually suggestive expression. The phrase is often used mockingly or insultingly, leveraging crude humor. Given its implicit offensive tone and potential for mockery or dehumanization (reducing someone to a body part), it qualifies as toxic under the definition of indirect, slang-based derogatory language.",
        "toxicity": "TOXIC",
        "toxicity_gpt_reason": "Cụm “sọ quả cam” là ẩn dụ chê ngoại hình (đầu tròn/hói như quả cam), mang tính mỉa mai và hạ thấp, thuộc dạng xúc phạm ngoại hình dù không nêu đích danh ai."
    },
    {
        "text": "ngọc diệp nghe đớn v cha 🥹",
        "category": "lgbtq",
        "id": "lgbtq_6153",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "The phrase 'nghe đớn' is a slang expression often used to convey a sense of disappointment, pity, or that something is unfortunate or 'cringe' to hear. The word 'cha' is a casual, colloquial interjection similar to 'trời ơi' or 'oh man'. The pleading face emoji 🥹 adds a layer of vulnerability or a 'poor you' sentiment. There is no insult, harassment, hate speech, or targeted negativity towards any individual or group. The tone is one of sympathetic or playful commiseration rather than toxicity.",
        "toxicity_mistral_reason": "The phrase 'nghe đớn v cha' is a deformation of 'nghe đồn vậy cha' but uses 'đớn' (a slang term often associated with disgust or contempt) and 'v cha' (a vulgar deformation of 'vậy cha,' where 'cha' is a profanity). The tone is mocking and disrespectful, and the crying emoji 🥹 is used sarcastically to amplify the insult rather than express genuine emotion.",
        "toxicity_qwen_reason": "The phrase 'đớn v cha' is a slang deformation of 'đau vì cha' (hurts because of dad), but phonetically resembles 'đồ ngợc', a vulgar insult. Combined with the crying-laughing emoji 🥹, it carries a mocking tone. The expression uses crude, dismissive language that can be interpreted as disrespectful or emotionally charged negativity, especially in a personal reference.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu nói mang tính cảm thán kiểu ‘nghe đớn vậy cha/vãi cha’ (nghe đau lòng quá), kèm emoji 🥹 thể hiện đồng cảm. Không có chửi bới hay công kích cá nhân/nhóm nào."
    },
    {
        "text": "touya úp mì kay ủa r cúi cùng có thấy cái j nhô chx 🥵",
        "category": "lgbtq",
        "id": "lgbtq_14415",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "Câu bình luận sử dụng ngôn ngữ teen và có thể mang hàm ý tình dục nhẹ, nhưng không nhắm vào cá nhân hay nhóm cụ thể nào để xúc phạm, lăng mạ hoặc quấy rối. Trong ngữ cảnh phù hợp, đây có thể chỉ là bình luận vui đùa, không chứa ngôn từ thù địch, phân biệt đối xử hay tạo ra sự tiêu cực đáng kể.",
        "toxicity_mistral_reason": "The text contains mocking and derogatory elements. 'Touya úp mì kay' is a distorted way of saying 'Touya up mì cay' (Touya posting spicy noodles), which is likely a playful or teasing remark. However, the latter part 'ủa r cúi cùng có thấy cái j nhô chx 🥵' implies frustration or ridicule, with 'cúi cùng' (finally) and 'có thấy cái j nhô chx' (do you see anything sticking out?) being used in a sarcastic or dismissive tone. The emoji 🥵 (hot face) further emphasizes mockery or annoyance, making the overall tone disrespectful and negative.",
        "toxicity_qwen_reason": "The text appears to be a mix of teen-code, slang, and possibly phonetic typing, but does not contain clear insults, mockery, or targeting of individuals or groups. It seems to express surprise or confusion in a casual, informal way without hostile intent. There is no detectable profanity, hate speech, or derogatory implications based on cultural context.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu mang tính đùa cợt/ám chỉ tình dục (“có thấy cái gì nhô chưa” + 🥵) nhưng không có chửi tục, xúc phạm, công kích hay thù ghét cá nhân/nhóm. Tông điệu trêu đùa, không thể hiện thái độ thù địch hay miệt thị."
    },
    {
        "text": "có vài trg hợp xảy ra là thói hư,tật xấu như trộm cắp,lừa lọc,bất lịch sự của 1 vài ng ở th,nó gây ra tiếng xấu cho ng th,chứ còn về tài thì ko phải nx r.từng có tụi lắp biển xe th đi trộm chó nx mà",
        "category": "region",
        "id": "region_32436",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The comment discusses negative behaviors (theft, deceit) attributed to a minority within a specific regional group (likely 'TH' as Thanh Hóa) and acknowledges that these actions harm the group's reputation. It distinguishes these actions from the group's talent or general character. The tone is observational and critical of specific actions rather than hostile, contemptuous, or broadly demeaning towards the entire regional community. No slurs, sarcasm, or derogatory terms are used.",
        "toxicity_mistral_reason": "The comment generalizes negative traits ('thói hư, tật xấu như trộm cắp, lừa lọc, bất lịch sự') to a broad group ('ng ở th' – likely referring to people from a specific region, e.g., 'Thanh Hóa' or 'Thái Bình'). This perpetuates regional stereotypes and assigns collective blame, which is discriminatory and harmful. The tone is implicitly hostile, even if not explicitly profane.",
        "toxicity_qwen_reason": "Văn bản đề cập đến hành vi tiêu cực của một số cá nhân (trộm cắp, lừa lọc, bất lịch sự) ở TP.HCM (th) và nhận định rằng những hành vi này gây tiếng xấu cho người dân miền đó, nhưng không dùng ngôn ngữ miệt thị, sỉ nhục hay tấn công cả nhóm. Người viết phân biệt rõ giữa hành vi cá nhân và đánh giá chung ('về tài thì ko phải nx'), thể hiện thái độ phê phán hành vi chứ không phải định kiến với cộng đồng. Mặc dù có thể gợi cảm giác nhạy cảm về vùng miền, nhưng không mang tính phân biệt hay hạ thấp tập thể, do đó không đủ yếu tố để được coi là toxic.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Nội dung bàn về một số trường hợp xấu và ảnh hưởng đến danh tiếng người Thanh Hóa nhưng nhấn mạnh chỉ là ‘một vài người’, không xúc phạm cả nhóm; giọng điệu giải thích, không có từ ngữ thô tục hay tấn công cá nhân/nhóm."
    },
    {
        "text": "nó giống như giới tính thực tại của bạn. bạn là con trai thì làm sao bạn thành con gái đc.. vậy làm sao bạn vẫn đâm đầu vào làm ctrai, họ cũng z, giới của họ như vậy, họ k thể thay đổi đc.",
        "category": "lgbtq",
        "id": "lgbtq_22019",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The text dismisses the possibility of gender transition by stating 'giới của họ như vậy, họ k thể thay đổi đc' (their gender is like that, they cannot change it), which invalidates transgender identities and perpetuates discriminatory views on gender, contributing to a hostile environment for LGBTQ+ individuals.",
        "toxicity_mistral_reason": "The text contains derogatory language and mockery aimed at transgender individuals, implying that their gender identity is invalid and cannot be changed. The use of phrases like 'giới tính thực tại' (real gender) and 'đâm đầu vào làm ctrai' (insisting on being a girl) is disrespectful and dismissive of transgender experiences.",
        "toxicity_qwen_reason": "The text discusses gender identity in a metaphorical and reflective way, comparing it to unchangeable reality. While it expresses a viewpoint on transgender identity, it does so without using derogatory language, slurs, or personal attacks. The tone is explanatory rather than hostile, and it does not promote hate or mockery. Although the perspective may be seen as controversial or dismissive by some, it remains within the bounds of non-toxic discourse as it avoids abusive or disrespectful language.",
        "toxicity": "TOXIC",
        "toxicity_gpt_reason": "Phát ngôn phủ nhận khả năng/định danh giới của người khác (“bạn là con trai thì làm sao thành con gái được”, “họ không thể thay đổi được”), gián tiếp phủ nhận người chuyển giới/LGBTQ. Dù không chửi tục, nội dung mang tính kỳ thị và hạ thấp một nhóm dựa trên bản dạng giới."
    },
    {
        "text": "lẩu gà cúc sang thái đi😏😏",
        "category": "lgbtq",
        "id": "lgbtq_31238",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "The comment is a casual suggestion to go eat chicken hotpot ('lẩu gà'), likely with friends. The emoji 😏 may imply a playful or suggestive tone, but the message itself contains no insults, hate speech, discrimination, or hostility toward any person or group. It is a neutral, food-related statement.",
        "toxicity_mistral_reason": "The text mentions 'lẩu gà cúc sang thái' (a type of hotpot) in a neutral or playful tone, accompanied by winking emojis 😏😏. There is no insult, mockery, or negative implication toward any individual, group, or cultural element. The comment is lighthearted and does not violate toxicity criteria.",
        "toxicity_qwen_reason": "- 'lẩu gà cúc' là cách nói lái nhạy cảm, có thể hiểu ám chỉ thô tục (lái từ 'lồn gà cúc', liên quan vùng kín). \n- Kết hợp biểu cảm '😏😏' tăng tính châm biếm, khiêu khích. \n- Ngữ cảnh có thể mang tính trêu chọc, hạ thấp, phù hợp mô hình ngôn ngữ độc hại ẩn dụ, sử dụng tiếng lóng nhạy cảm.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu nói mang tính rủ rê/đùa vui (đi Thái, ăn lẩu gà) với emoji nháy môi. Không có chửi bới, miệt thị hay nhắm vào cá nhân/nhóm nào. Ý nghĩa mơ hồ nhưng không thể hiện sự xúc phạm."
    },
    {
        "text": "thành đại tá b thật sự học luật kh nhỉ? sao lý luận của bạn nó cứ cấn cấn thế nào ấy. đẹp xấu quan trọng hả bạn? người đẹp có quyền xúc phạm ng khác, ng đẹp muốn làm gì làm đạo đức pháp luật đều kh can thiệp hả bạn? cái ý của bạn nữ có thể kh truyền đạt tốt chứ nó cũng đâu có sai, bạn lướt xuống đọc đi, nhiều cmt xúc phạm vô học cực kì. nếu b muốn góp ý chỉ đơn giản dùng lập luận th bạn, cần gì công kích thẳng bằng cách lưu và public ảnh bạn ấy như thế, nó kh giống kiểu người học thức làm b à.",
        "category": "lgbtq",
        "id": "lgbtq_2664",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The text criticizes someone's reasoning and actions in a debate context, advocating for respectful communication and ethical behavior. While it uses sarcastic rhetorical questions, it does not contain profanity, personal insults, hate speech, or unreasonable hostility. The tone is confrontational but focused on constructive criticism and defense of others against offensive comments.",
        "toxicity_mistral_reason": "The text contains several toxic elements. It includes personal attacks, sarcasm, and derogatory language. The use of phrases like 'cấn cấn' (stubborn) and 'xúc phạm' (offend) indicates a hostile tone. The text also implies that the person being addressed is not knowledgeable or reasonable, which is disrespectful. Additionally, the mention of 'public ảnh' (public image) and 'lưu' (save) suggests a malicious intent to harm the other person's reputation. The overall tone is confrontational and disrespectful, making it toxic.",
        "toxicity_qwen_reason": "Văn phong thể hiện sự bất đồng quan điểm một cách phản biện, có chỉ trích hành vi (công khai ảnh, giọng điệu công kích) nhưng không dùng từ ngữ miệt thị, tục tĩu hay tấn công nhân thân. Người viết bênh vực một người khác, phê phán cách ứng xử thiếu tôn trọng, nhấn mạnh đến đạo đức, lập luận và thái độ của người có học. Dù mang tính chất gay gắt, nhưng vẫn giữ được lập trường trong việc phản đối hành vi thiếu văn hóa, không mang dấu hiệu độc hại theo định nghĩa.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Nội dung phê bình cách hành xử và lập luận (việc public ảnh, công kích), dùng lời lẽ cứng rắn nhưng không có chửi tục, đe dọa hay miệt thị nhóm người nào. Cụm “vô học” hướng vào tính chất bình luận (cmt) chứ không nhắm thẳng cá nhân; nhìn chung là chỉ trích hành vi, không phải công kích thù hằn."
    }
]