[
    {
        "text": "bả hạnh phúc",
        "category": "lgbtq",
        "id": "lgbtq_5696",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The phrase 'bả hạnh phúc' literally means 'she is happy.' It is a simple, positive statement about someone's emotional state. There is no use of slang, profanity, sarcasm, or any element that targets, insults, or demeans an individual or group. The tone is neutral and declarative.",
        "toxicity_mistral_reason": "The term 'bả' is a derogatory and disrespectful way to refer to a woman, often carrying a negative or mocking tone. Even without additional context, using 'bả' to address or describe someone is considered rude and demeaning in Vietnamese culture.",
        "toxicity_qwen_reason": "The phrase 'bả hạnh phúc' literally means 'she is happy' and carries a neutral or potentially positive tone. There is no derogatory language, slang, or implied mockery present. Without additional context suggesting sarcasm or targeting someone negatively, the statement is non-toxic.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Chỉ mô tả trạng thái hạnh phúc của một người. “Bả” là cách xưng hô khẩu ngữ miền Nam, trung tính trong ngữ cảnh này, không có xúc phạm hay công kích."
    },
    {
        "text": "khang nguyễn ựa ựa",
        "category": "lgbtq",
        "id": "lgbtq_6873",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The phrase 'ựa ựa' is an onomatopoeic expression mimicking the sound of vomiting or gagging. Attaching this sound directly to a person's name ('khang nguyễn') is a clear expression of disgust, mockery, and disrespect directed at that individual. It serves no constructive purpose and is intended to demean.",
        "toxicity_mistral_reason": "The phrase 'ựa ựa' is a derogatory expression in Vietnamese slang, often used to mock someone's appearance or behavior in a disgusting or repulsive way. Here, it is directed at 'Khang Nguyễn', making it a personal insult with a negative and demeaning tone.",
        "toxicity_qwen_reason": "The text 'khang nguyễn ựa ựa' appears to be a neutral mention of a name followed by non-lexical vocalizations ('ựa ựa'), which may express hesitation, playfulness, or casual tone. There is no evident insult, profanity, sarcasm, or negative targeting. Without additional context indicating mockery or derogatory intent, the phrase remains non-toxic.",
        "toxicity": "TOXIC",
        "toxicity_gpt_reason": "Nhắc đích danh “khang nguyễn” kèm âm thanh “ựa ựa” (tiếng nôn/ghê tởm) để biểu đạt sự khinh miệt, chế nhạo. Giọng điệu xúc phạm, mang tính công kích cá nhân."
    },
    {
        "text": "vn đó h vậy mà",
        "category": "lgbtq",
        "id": "lgbtq_23319",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The text uses common slang ('vn' for Vietnam) and a neutral phrase ('vậy mà') to make an observational or mildly surprised comment about Vietnam, without containing derogatory terms, insults, profanity, or targeted negativity. It lacks implicit signals of toxicity such as sarcasm, mockery, or hate speech.",
        "toxicity_mistral_reason": "The text 'vn đó h vậy mà' is a phonetic approximation of 'Việt Nam đó hư vậy mà' (Vietnam is so corrupted/degenerate). The tone is dismissive and negative, implying criticism or contempt toward the country or its people, which can be considered toxic due to its emotionally negative and disrespectful nature.",
        "toxicity_qwen_reason": "The text 'vn đó h vậy mà' is a shortened, informal way of saying 'Việt Nam đó huh, vậy mà' (Vietnam, you know, it's like that). It expresses a resigned or ironic observation about a common reality in Vietnam, possibly referencing a systemic issue or behavioral norm. While it carries mild sarcasm or disappointment, it does not target any individual or group with hostility, abuse, or discriminatory language. The tone is colloquial but not toxic.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu viết tắt/teen-code mang nghĩa trung tính (“Việt Nam bây giờ vậy mà”), không có xúc phạm, công kích hay miệt thị cá nhân/nhóm nào."
    },
    {
        "text": "🤣xã nào đấy",
        "category": "region",
        "id": "region_8644",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The comment '🤣xã nào đấy' uses a laughing emoji and the term 'xã' (commune) in a sarcastic tone, implying mockery or disdain towards a rural or less developed area, which is disrespectful and demeaning in cultural context.",
        "toxicity_mistral_reason": "Câu nói '🤣xã nào đấy' chỉ đơn thuần là một câu hỏi mang tính hài hước, không có ý xúc phạm, chế giễu hay công kích cá nhân hay nhóm nào. Biểu tượng cười (🤣) thể hiện sự vui vẻ, không mang tính chất tiêu cực hay thù địch.",
        "toxicity_qwen_reason": "The text '🤣xã nào đấy' translates to 'Which commune is that?' with a laughing emoji, likely expressing amusement or confusion in a light-hearted, non-targeted way. There is no clear insult, derogatory term, or negative intent toward any individual or group. Without additional context implying mockery or regional disdain, this expression remains playful and neutral.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Chỉ là emoji cười kèm câu hỏi “xã nào đấy” (hỏi địa điểm). Không có từ ngữ xúc phạm, chê bai hay nhắm mục tiêu cá nhân/nhóm; tone mang tính bông đùa."
    },
    {
        "text": "biết sao mỹ giàu rồi hahahaha",
        "category": "lgbtq",
        "id": "lgbtq_24982",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "Câu nói mang tính chất hài hước, bông đùa về sự giàu có của nước Mỹ. Dù có thể hàm ý mỉa mai nhẹ, nhưng không nhắm vào cá nhân hay nhóm nào với ngôn từ xúc phạm, đe dọa, hoặc kỳ thị. Tiếng cười 'hahahaha' thể hiện sự vui đùa chứ không phải sự chế nhạo độc hại.",
        "toxicity_mistral_reason": "The comment uses a mocking tone ('hahahaha') to imply that the U.S.'s wealth is due to some negative or unworthy reason, which can be interpreted as dismissive or derogatory toward the country or its people. The laughter emoji-like expression ('hahahaha') adds a sarcastic or belittling tone, making the statement toxic.",
        "toxicity_qwen_reason": "The phrase 'biết sao mỹ giàu rồi hahahaha' uses laughter (hahahaha) to mock or sarcastically imply a superficial or conspiratorial explanation for the wealth of the U.S., potentially belittling serious socio-economic factors. The tone is derisive and dismissive, and in context, it can implicitly mock either the audience's understanding or perpetuate cynical, oversimplified views about global power, which aligns with toxic sarcasm and mockery.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Nhận xét chung về nước Mỹ kèm tiếng cười, không chứa từ ngữ xúc phạm hay miệt thị cá nhân/nhóm nào."
    },
    {
        "text": "đúng là bậc kỳ tài thiên hạ,mong ac đi lâu lâu một chút để thiên hạ được nhờ",
        "category": "region",
        "id": "region_2064",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "The text uses sarcasm to mock an individual by superficially praising them as a 'genius of the world' but then expressing a hope that they leave for a long time, implying their absence would benefit others. This conveys disrespect and emotional negativity through indirect contempt.",
        "toxicity_mistral_reason": "The comment uses exaggerated praise ('bậc kỳ tài thiên hạ') in a sarcastic or humorous tone, but it does not directly insult, demean, or target anyone negatively. The phrase 'mong ac đi lâu lâu một chút để thiên hạ được nhờ' is a playful way of saying the person is causing trouble or annoyance, but it lacks explicit hostility, profanity, or discriminatory intent. The tone is more teasing than toxic.",
        "toxicity_qwen_reason": "- 'Bậc kỳ tài thiên hạ' dùng với ngữ điệu mỉa mai, không phải khen thật lòng.\n- Câu 'mong ac đi lâu lâu một chút để thiên hạ được nhờ' ngụ ý khi người đó đi vắng, xã hội mới bớt khổ, mang tính châm biếm nặng nề.\n- Câu nói thể hiện sự miệt thị, xúc phạm gián tiếp thông qua giọng điệu châm chọc và hàm ý tiêu cực, phù hợp với dạng thức độc hại ngụy trang dưới vẻ ngoài 'hài hước'.",
        "toxicity": "TOXIC",
        "toxicity_gpt_reason": "Lời khen “bậc kỳ tài thiên hạ” mang tính mỉa mai, kèm mong muốn người đó “đi lâu lâu” để “thiên hạ được nhờ”, biểu đạt thái độ khinh miệt và muốn đuổi người ta đi. Giọng điệu châm biếm, tiêu cực nhắm vào cá nhân."
    },
    {
        "text": "nghệ an thanh hóa🥺😌",
        "category": "region",
        "id": "region_16219",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "The text simply names two Vietnamese provinces (Nghệ An and Thanh Hóa) with emojis (🥺😌) that express personal emotion, such as nostalgia or affection. There is no explicit or implicit derogatory language, regional bias, mockery, or targeting of any group, and the tone is neutral or positive without toxicity.",
        "toxicity_mistral_reason": "The phrase 'Nghệ An Thanh Hóa' is often used in a derogatory or mocking context, referencing stereotypes about people from these regions (e.g., associated with poverty or backwardness). The emojis 🥺😌 add a tone of sarcasm or condescension, implying mockery rather than genuine affection or pride.",
        "toxicity_qwen_reason": "The phrase 'nghệ an thanh hóa' followed by pleading and smiling emojis can be a subtle, sarcastic reference to the stereotype associated with people from Thanh Hóa and Nghệ An, often linked with the 'ăn rau má, phá đường tàu' saying. In online contexts, merely naming these regions in a teasing tone, especially with emojis that mock emotional appeal, can imply regional bias or ridicule, aligning with toxic stereotyping.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Chỉ nêu tên hai tỉnh (Nghệ An, Thanh Hóa) kèm emoji trung tính/thiện cảm, không có từ ngữ miệt thị, công kích hay hàm ý tiêu cực rõ ràng."
    },
    {
        "text": "bớt bớt lại thấy ghê",
        "category": "lgbtq",
        "id": "lgbtq_600",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "Câu 'bớt bớt lại thấy ghê' là một lời nhắc nhở hoặc yêu cầu ai đó nên giảm bớt một hành vi, phong cách hoặc mức độ nào đó vì nó khiến người nói cảm thấy 'ghê' (khó chịu, quá đà, hoặc không phù hợp). Mặc dù có sắc thái tiêu cực nhẹ, câu nói này thiếu yếu tố xúc phạm cá nhân, ngôn từ tục tĩu, kỳ thị, hoặc ý đồ gây hấn rõ ràng. Nó thuộc dạng phê bình hoặc bày tỏ cảm xúc cá nhân một cách trực tiếp nhưng không mang tính độc hại.",
        "toxicity_mistral_reason": "The phrase 'bớt bớt lại thấy ghê' implies disgust or revulsion toward someone or something, often used to criticize appearance or behavior in a harsh and disrespectful manner. The tone is negative and demeaning, which fits the definition of toxic language.",
        "toxicity_qwen_reason": "The phrase 'bớt bớt lại thấy ghê' uses sarcasm to imply that the person or thing being referred to is so excessive or unpleasant that reducing it still leaves a disgusting impression. The word 'ghê' (disgusting/repulsive) carries a strong negative emotional charge, and the tone suggests mockery or disdain, contributing to a hostile or demeaning tone.",
        "toxicity": "TOXIC",
        "toxicity_gpt_reason": "Câu nói mang tính chê bai, hạ thấp (“bớt bớt lại” kèm “thấy ghê” ám chỉ đối phương đáng ghét/kinh), thể hiện thái độ thô lỗ và xúc phạm dù không dùng từ tục."
    },
    {
        "text": "đạp có mỗi cái cổng mà giận lâu thế",
        "category": "region",
        "id": "region_13558",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "Câu này là một lời nhận xét về việc ai đó giận quá lâu vì một sự việc nhỏ (đạp cổng). Nó không chứa ngôn từ xúc phạm, đe dọa, phân biệt đối xử hay thù hận. Giọng điệu có thể hơi trêu chọc nhẹ nhưng không mang tính ác ý, công kích cá nhân, và không nhắm vào nhóm nào. Đây chỉ là một bình luận thông thường về cảm xúc, không đạt ngưỡng độc hại.",
        "toxicity_mistral_reason": "The phrase 'đạp có mỗi cái cổng mà giận lâu thế' is a casual, slightly teasing remark that playfully expresses frustration or impatience (e.g., 'You only tripped on the gate, why be mad for so long?'). It does not contain insults, slurs, or derogatory language. The tone is lighthearted and not directed at demeaning any individual or group.",
        "toxicity_qwen_reason": "The phrase implies disproportionate anger over a small incident ('đạp có mỗi cái cổng'), mocking someone for being overly sensitive. The dismissive tone and trivialization of another's feelings can be emotionally invalidating and condescending, which constitutes passive-aggressive, emotionally negative behavior.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu nói mang tính trêu nhẹ/phản nàn vui về chuyện nhỏ (“đạp có mỗi cái cổng mà giận lâu thế”) mà không dùng từ ngữ xúc phạm, miệt thị hay lời đe doạ; không nhắm vào nhóm hay cá nhân theo cách hạ nhục."
    },
    {
        "text": "nghĩ tích cực như ông thì ai cũng mừng 🫠",
        "category": "lgbtq",
        "id": "lgbtq_22386",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "Câu nói sử dụng giọng điệu mỉa mai, châm biếm. Mặc dù bề mặt là khen 'nghĩ tích cực', nhưng biểu tượng cảm xúc 🫠 (mặt tan chảy) thể hiện sự chế giễu, khó chịu hoặc không đồng tình, ngụ ý rằng sự tích cực của 'ông' là ngây thơ, phi thực tế hoặc đáng chán. Đây là một lời nói mang tính tiêu cực và gây hại cho cuộc trò chuyện.",
        "toxicity_mistral_reason": "The comment uses a lighthearted tone to express admiration for someone's positive thinking ('nghĩ tích cực'). The emoji 🫠 conveys mild exasperation or amusement, not mockery or hostility. There is no insult, slur, or negative targeting of any individual or group.",
        "toxicity_qwen_reason": "The phrase 'nghĩ tích cực như ông thì ai cũng mừng' is a sarcastic compliment suggesting someone is overly optimistic, but the use of 'ông' (a respectful term for 'you') and the emoji 🫠 (indicating being overwhelmed, not mockery) softens the tone. It lacks direct insults, slurs, or aggressive intent. In Vietnamese context, this is mild banter, not toxic.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu mang tính khen/châm biếm nhẹ về sự tích cực, không có chửi thề, xúc phạm hay kỳ thị; từ xưng hô “ông” là khẩu ngữ bình thường, emoji 🫠 thể hiện chút mỉa mai nhưng không vượt ngưỡng công kích."
    },
    {
        "text": "bn có hc ko thế?",
        "category": "region",
        "id": "region_13063",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The text questions the recipient's education in a dismissive and confrontational tone, implying ignorance or lack of intelligence, which is disrespectful and constitutes a personal insult.",
        "toxicity_mistral_reason": "Câu hỏi 'bn có hc ko thế?' sử dụng từ viết tắt 'hc' (học) nhưng mang giọng điệu mỉa mai, ngụ ý chê bai hoặc coi thường trình độ, kiến thức của người khác. Ngữ điệu này thể hiện sự thiếu tôn trọng và có thể gây khó chịu, đặc biệt trong ngữ cảnh giao tiếp trực tuyến.",
        "toxicity_qwen_reason": "The text 'bn có hc ko thế?' is a casual, phonetically shortened way of asking 'Bạn có học không thế?' (Do you even go to school?). While slightly informal or sarcastic in tone, it lacks explicit hostility, profanity, or targeting based on identity. It may express mild skepticism but does not cross into abusive or demeaning language. Without additional context indicating a personal attack, it remains within the bounds of colloquial, non-toxic expression.",
        "toxicity": "TOXIC",
        "toxicity_gpt_reason": "Câu rút gọn “bn có hc ko thế?” là cách nói mỉa/chê bai phổ biến, đặt vấn đề về học thức/trí tuệ của người khác theo giọng khinh miệt. Mang tính xúc phạm dù không có từ tục."
    },
    {
        "text": "hay bạn ơi bọn kia cay lắm chỉ bt spam thoi",
        "category": "region",
        "id": "region_14094",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "Bình luận mô tả một tình huống (bọn kia 'cay' và spam) bằng giọng điệu thông thường, không chứa lời lẽ xúc phạm, đe dọa, công kích cá nhân/nhóm cụ thể nào. 'Cay' là tiếng lóng phổ biến chỉ sự tức giận/bực bội, không mang tính độc hại trong ngữ cảnh này.",
        "toxicity_mistral_reason": "The comment uses the term 'bọn kia' (those guys) in a dismissive and negative way, implying that the targeted group is only capable of 'spam' (a low-effort or annoying action). The tone is derogatory and mocking, contributing to hostility in the discussion.",
        "toxicity_qwen_reason": "The text is a casual, friendly remark acknowledging that others are frustrated ('cay lắm') but downplays their behavior as just spamming ('chỉ bt spam thoi'). It does not contain insults, profanity, or hostile intent. The tone is explanatory and mildly empathetic, not targeting anyone negatively.",
        "toxicity": "TOXIC",
        "toxicity_gpt_reason": "Gồm từ ngữ miệt thị nhắm vào nhóm khác: “bọn kia”, nói họ “cay lắm” và “chỉ biết spam thôi”, mang tính chế giễu và hạ thấp."
    },
    {
        "text": "m ở đâu mới xuống hả",
        "category": "lgbtq",
        "id": "lgbtq_23133",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The text uses informal 'm' (mày) and questions the person's origin with 'mới xuống', implying they are from a rural or inferior area, which carries a condescending and mocking tone.",
        "toxicity_mistral_reason": "The comment 'm ở đâu mới xuống hả' translates to 'Where are you from, just came down?' in English. It is a casual, neutral question often used in online gaming or chat contexts to ask where someone is joining from (e.g., a different region or server). There is no insult, mockery, or negative intent toward any individual or group. The tone is inquisitive rather than hostile.",
        "toxicity_qwen_reason": "The text 'm ở đâu mới xuống hả' is a casual, colloquial way of asking someone where they have just arrived from. It uses informal pronouns ('m' for 'mày') common in friendly or familiar conversations among peers. There is no insulting, mocking, or negative intent detected. The tone is neutral and conversational, without any derogatory implications or cultural sensitivities being triggered.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu hỏi thân mật/khẩu ngữ (“m” có thể là ‘mày’ hoặc ‘mình’) hỏi nguồn gốc/vừa từ đâu đến; không có chửi bới, xúc phạm hay đe doạ. Giọng hơi suồng sã nhưng không mang tính công kích."
    },
    {
        "text": "\"đụng đến mà dãy thì chỉ chứng tỏ bạn không có đủ lý do để phản biện một cách bình tĩnh.\" cứ \"dãy\" mỗi lần bị phản đối, có nghĩa là bạn chỉ biết phản ứng theo cảm tính, chứ không có đủ kiến thức để tham gia vào cuộc thảo luận một cách thấu đáo.",
        "category": "lgbtq",
        "id": "lgbtq_18994",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "Câu nói sử dụng từ 'dãy' (cách nói khinh miệt cho 'giãy giụa' hoặc 'phản ứng thái quá') để miêu tả và chế giễu phản ứng của người đối thoại. Nó gán cho đối phương là người 'phản ứng theo cảm tính', 'không có đủ kiến thức' và 'không đủ lý do để phản biện bình tĩnh', nhằm hạ thấp và phủ nhận giá trị tranh luận của họ. Ngôn từ mang tính chất công kích cá nhân, chứa sự chê bai và thái độ trịch thượng, tạo ra sự đối đầu và thiếu tôn trọng trong giao tiếp.",
        "toxicity_mistral_reason": "The text uses the word 'dãy' (a phonetic approximation of a vulgar term) to describe the opponent's reaction, implying they are unreasonable and lack knowledge. This is a direct insult, mocking the person's ability to engage in discussion, and introduces hostility and negativity into the conversation.",
        "toxicity_qwen_reason": "Văn phong phê bình mang tính phân tích, nhắm vào hành vi thiếu lý lẽ trong tranh luận chứ không tấn công cá nhân. Dù dùng từ 'dãy' mang sắc thái miêu tả phản ứng cảm tính, nhưng không mang tính tục tĩu hay miệt thị; ngữ cảnh thể hiện mong muốn thúc đẩy tranh luận lý tính, không có dấu hiệu chế giễu, phân biệt hay thù ghét.",
        "toxicity": "TOXIC",
        "toxicity_gpt_reason": "Nhắm trực tiếp vào người đối thoại (“bạn”), chê họ chỉ phản ứng cảm tính và “không có đủ kiến thức” để thảo luận. Giọng điệu hạ thấp, miệt thị năng lực tranh luận, mang tính công kích cá nhân dù không dùng tục."
    },
    {
        "text": "quang minh bạn mua được phóng tên lửa đi hẵng nói nhỉ",
        "category": "lgbtq",
        "id": "lgbtq_9147",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "Câu nói là lời chỉ trích/châm biếm nhẹ nhàng đối với một ý kiến được cho là viển vông hoặc không thực tế ('mua được tên lửa'). Tuy có ý mỉa mai, nó không chứa ngôn từ lăng mạ, công kích cá nhân trực tiếp, phân biệt đối xử, hoặc thù hận. Cách xưng hô 'bạn' và cấu trúc câu vẫn trong khuôn khổ tranh luận thông thường.",
        "toxicity_mistral_reason": "The phrase 'mua được phóng tên lửa đi hẵng nói' is a sarcastic and dismissive remark, implying that the person should achieve something extraordinary (like buying and launching a rocket) before speaking. This is a form of belittling or mocking the target, conveying disrespect and hostility.",
        "toxicity_qwen_reason": "The statement sarcastically mocks Quang Minh, implying he is insignificant or incapable by challenging him to 'buy and launch a rocket' before speaking. The tone is dismissive and ridiculing, using hyperbole to belittle the person, which constitutes indirect personal attack and disrespectful criticism.",
        "toxicity": "TOXIC",
        "toxicity_gpt_reason": "Câu nói mang tính mỉa mai, hạ thấp đối phương (“mua được/phóng tên lửa đi hẵng nói”) nhằm bịt miệng và phủ định quyền lên tiếng của người được nhắc tên. Giọng điệu khinh miệt, công kích cá nhân dù không dùng tục tĩu."
    },
    {
        "text": "ken kenny báo bộ văn hoá thể thao và du lịch đi. chắc họ sẽ nghe bạn đấy",
        "category": "lgbtq",
        "id": "lgbtq_13370",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "Câu nói mang tính đề xuất hoặc gợi ý một cách thông thường, không chứa ngôn từ lăng mạ, công kích cá nhân hoặc nhóm nào. Không có yếu tố chế giễu, kỳ thị hay biểu hiện tiêu cực rõ ràng khi xét về mặt văn bản và ngữ cảnh chung.",
        "toxicity_mistral_reason": "The phrase 'ken kenny' is a derogatory deformation of 'Kinh Kệ' (a mocking term for religious chants, often used to belittle religious practices). The comment sarcastically suggests reporting to the Ministry of Culture, Sports and Tourism, implying that the person's views or behavior are so absurd or offensive that even authorities would agree. This conveys disrespect and mockery toward religious or cultural practices, making it toxic.",
        "toxicity_qwen_reason": "The text uses sarcasm by suggesting that Ken Kenny should report to the Ministry of Culture, Sports and Tourism, implying absurdly that the ministry would listen to him, which mocks the individual’s credibility or importance. The sarcastic tone undermines the person in a disrespectful way, constituting indirect toxicity.",
        "toxicity": "TOXIC",
        "toxicity_gpt_reason": "Lời nói mỉa mai, giễu cợt nhắm vào người khác (“chắc họ sẽ nghe bạn đấy”) nhằm hạ thấp, phủ nhận tầm ảnh hưởng của họ; mang tính chế nhạo dù không dùng từ tục."
    },
    {
        "text": "em đây có mấy anh 36 lúc khó khăn thì em ơi giúp anh với.nhà không có tiền cũng đi mượn giúp anh đủ chuyện rồi mất hút cả chục năm nay.... chán",
        "category": "region",
        "id": "region_18333",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "Đây là lời tâm sự, than thở về trải nghiệm cá nhân khi bị người khác vô ơn, không trả ơn sau khi được giúp đỡ. Văn bản thể hiện sự thất vọng, chán nản ('chán') nhưng không chứa lời lẽ xúc phạm, đe dọa, kỳ thị hay có ý đồ gây hấn với cá nhân/nhóm nào. Đây là biểu đạt cảm xúc tiêu cực thông thường, không mang tính độc hại.",
        "toxicity_mistral_reason": "The text implies a manipulative or exploitative dynamic, where the speaker ('anh 36'—a slang term often referring to older men in a transactional or predatory context) is portrayed as taking advantage of the listener ('em') during difficult times, borrowing money, and then disappearing for years. This carries negative connotations of emotional neglect, financial exploitation, and disrespect, contributing to a toxic tone.",
        "toxicity_qwen_reason": "The text expresses personal disappointment and frustration towards people (the 'anh 36') who disappeared after receiving help, but does so in a reflective and lamenting tone rather than with hostility, insult, or profanity. The use of '36' may refer to a regional or contextual code (e.g., age, label), but without clear derogatory intent or slurs. The sentiment is critical but not abusive or demeaning.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Chỉ là lời than phiền về việc giúp đỡ rồi bị mất liên lạc, không có chửi bới, xúc phạm hay miệt thị cá nhân/nhóm nào. Tông giọng bức xúc nhẹ, không công kích."
    },
    {
        "text": "huong giang kkkkk",
        "category": "region",
        "id": "region_2650",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "The comment simply states a name ('Huong Giang') followed by 'kkkkk', which is a common textual representation of laughter (similar to 'haha'). There is no insult, derogatory language, or negative targeting evident in the text. Without additional context or pejorative terms, it reads as a neutral or amused mention of a public figure.",
        "toxicity_mistral_reason": "The text uses 'kkkkk' (a Vietnamese internet slang deformation of laughter, often used mockingly or derisively) to target Huong Giang, a well-known Vietnamese transgender celebrity. The repetitive 'k' sounds amplify the mocking tone, implying ridicule or disrespect toward her identity or appearance. This constitutes a form of harassment or derogatory humor targeting an individual based on their personal attributes.",
        "toxicity_qwen_reason": "The text 'huong giang kkkkk' uses laughter ('kkkkk', equivalent to 'hahaha') in a mocking tone directed at Hương Giang, a well-known transgender public figure in Vietnam. In online context, such abbreviated laughter following a person’s name often implies ridicule, especially given the history of transphobic trolling targeting her. The lack of context suggesting praise or neutral discussion increases the likelihood of demeaning intent.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Chỉ nêu tên kèm tiếng cười “kkkkk”, không có từ ngữ xúc phạm hay hàm ý hạ nhục rõ ràng; thiếu bối cảnh để kết luận chế giễu."
    },
    {
        "text": "chứ còn về vc học thì xin lỗi t năm thứ 5 dh điểm tích lũy cx 3.4 k cần ai dậy online đâu",
        "category": "lgbtq",
        "id": "lgbtq_17120",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "Câu nói mang tính chất tự bảo vệ và khoe thành tích học tập cá nhân (năm thứ 5 đại học, GPA 3.4), đồng thời khẳng định không cần học online. Mặc dù có thái độ hơi tự phụ và phòng thủ, nhưng ngôn từ không có yếu tố lăng mạ, đe dọa, kỳ thị hay gây hằn học với bất kỳ cá nhân/nhóm nào. Nội dung chủ yếu xoay quanh bản thân người nói.",
        "toxicity_mistral_reason": "The comment contains an arrogant and dismissive tone ('xin lỗi t năm thứ 5 dh điểm tích lũy cx 3.4 k cần ai dậy online đâu'). While not directly insulting, the phrasing ('xin lỗi' used sarcastically) and the implication of belittling others' teaching efforts introduce unnecessary negativity and disrespect, making it toxic.",
        "toxicity_qwen_reason": "The text expresses personal academic achievement (GPA 3.4 in year 5 of university) and a preference for not needing online lessons, possibly in response to criticism. While assertive, it does not contain insults, profanity, mockery, or hostility toward others. The tone is defensive but remains factual and self-referential, without targeting or demeaning any individual or group.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu mang tính khẳng định và bác bỏ lời dạy online, hơi kiêu nhưng không có chửi bới, xúc phạm, miệt thị hay đe dọa cá nhân/nhóm nào."
    },
    {
        "text": "thì nó muốn nói như vd đó, còn hỏi nữa???",
        "category": "lgbtq",
        "id": "lgbtq_25047",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "Câu nói có giọng điệu mỉa mai, thiếu kiên nhẫn ('còn hỏi nữa???'), thể hiện sự khinh thường và tạo ra sự thù địch không cần thiết trong giao tiếp, làm tổn hại đến không khí trao đổi.",
        "toxicity_mistral_reason": "The comment uses an impatient and dismissive tone ('còn hỏi nữa???'), which conveys irritation and disrespect toward the recipient. The phrase implies impatience and condescension, creating a hostile or negative interaction.",
        "toxicity_qwen_reason": "The text is an expression of impatience or frustration in a conversational context, but it does not contain insults, profanity, mockery, or any form of explicit or implicit toxicity towards a person or group. It uses no slang, slang-like deformation, sarcasm, or culturally sensitive references. The tone is direct but remains within neutral bounds of informal dialogue.",
        "toxicity": "TOXIC",
        "toxicity_gpt_reason": "Giọng điệu gắt gỏng và khinh miệt (“còn hỏi nữa???”) thể hiện thái độ thô rude, thiếu tôn trọng. Dù không chửi bới trực tiếp, cách nói mang tính gây hấn và hạ thấp người hỏi."
    },
    {
        "text": "thế mày có nợ người khác ko? có ai khác nợ mày nữa ko? mày có sống tốt ko",
        "category": "region",
        "id": "region_17753",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "Đoạn văn sử dụng từ 'mày' mang tính thân mật, suồng sã nhưng không mang ý xúc phạm. Nội dung là một loạt câu hỏi trực tiếp về tình hình cá nhân (nợ nần, lối sống) và không chứa lời lẽ miệt thị, đe dọa, kỳ thị hay có ý gây hấn. Giọng điệu là hỏi thăm/tò mò, không có dấu hiệu chế nhạo hoặc độc hại.",
        "toxicity_mistral_reason": "The comment uses the informal and slightly confrontational pronoun 'mày' (you, in a rude or familiar way) repeatedly, which can come across as aggressive or disrespectful. The tone is interrogative and intrusive, asking personal questions in a manner that may imply judgment or provocation. While not overtly profane or insulting, the phrasing and tone introduce unnecessary hostility into the interaction.",
        "toxicity_qwen_reason": "The text consists of neutral questions about someone's debts and life situation, which could be part of a genuine inquiry or conversation. While the tone is direct, it does not include insults, profanity, mockery, or discriminatory language. There is no evidence of sarcasm, hostility, or intent to demean in the literal meaning or context provided.",
        "toxicity": "TOXIC",
        "toxicity_gpt_reason": "Dùng đại từ 'mày' lặp lại trong câu hỏi chất vấn về nợ nần và đạo đức tạo sắc thái khinh miệt, công kích, thể hiện thái độ bất lịch sự và đối đầu dù không có chửi thề."
    },
    {
        "text": "cạn phước lắm mới xem được video nỳ 😢😢😢😢😢",
        "category": "lgbtq",
        "id": "lgbtq_13134",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "The text uses hyperbolic and sarcastic language ('cạn phước') with crying emojis to express disappointment about a video, but it does not target any person or group with insults, hate speech, or toxicity. It is a culturally common, light-hearted complaint about content, lacking abusive or discriminatory elements.",
        "toxicity_mistral_reason": "The phrase 'cạn phước' (out of luck/blessings) is a colloquial, slightly self-deprecating or humorous expression in Vietnamese, often used to imply that something is rare or difficult to encounter. The emojis 😢 convey sadness or exaggeration for comedic effect, but there is no insult, mockery, or hostility toward any individual or group. The tone is lighthearted and does not carry toxic intent.",
        "toxicity_qwen_reason": "The phrase 'cạn phước' (literally 'depleted blessings') is used sarcastically to imply that watching the video is such a terrible or regrettable experience that it must be a karmic punishment. The excessive crying emojis (😢) amplify the mocking, self-pitying tone. This conveys strong disdain or ridicule toward the content or creator, creating a hostile or emotionally negative atmosphere.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Chỉ là than thở/đùa tự trào về việc xem được video, dùng ‘cạn phước’ như cách nói xui rủi kèm emoji buồn; không công kích cá nhân/nhóm hay dùng từ ngữ thô tục."
    },
    {
        "text": "chia buồn cùng gd",
        "category": "region",
        "id": "region_25966",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "The text 'chia buồn cùng gd' translates to 'condolences to the family' and is a standard, respectful expression of sympathy. There is no harsh, rude, disrespectful, or emotionally negative language present. The intent is supportive and the tone is polite.",
        "toxicity_mistral_reason": "The phrase 'chia buồn cùng gd' (condolences to the family) is a respectful and empathetic expression of sympathy toward someone's loss. It does not contain any insults, mockery, or negative implications and is culturally appropriate in Vietnamese society for offering condolences.",
        "toxicity_qwen_reason": "Cụm 'chia buồn cùng gd' (gia đình) khi đứng riêng, nghe có vẻ nhân văn, nhưng trong nhiều ngữ cảnh mạng xã hội, cụm này thường được dùng một cách mỉa mai, chế giễu, đặc biệt là khi không có sự kiện tang sự thực sự. Khi không có bối cảnh rõ ràng, cụm từ này thường là tiếng lóng ám chỉ sự tàn hại, thua lỗ nặng nề (ví dụ trong cá cược, game) và mang tính xúc phạm, thiếu tôn trọng. Cách dùng này phổ biến trong văn hóa mạng để giễu cợt người khác 'chết giã', 'thua te tua'. Đây là dạng nói giảm nói tránh mang tính chế nhạo, nên xét là độc hại.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu bày tỏ lời chia buồn đến gia đình (“gd” = gia đình), mang tính cảm thông và lịch sự, không có xúc phạm hay công kích."
    },
    {
        "text": "giống này",
        "category": "region",
        "id": "region_7233",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "Cụm từ 'giống này' là cách diễn đạt trung lập, mang nghĩa 'loại này' hoặc 'kiểu này', thường dùng để chỉ trỏ hoặc phân loại một đối tượng nào đó. Không có từ ngữ xúc phạm, chửi thề, công kích cá nhân hay nhóm nào. Không mang giọng điệu mỉa mai, kỳ thị hoặc gây thù địch. Nội dung hoàn toàn vô hại và không vi phạm tiêu chí ngôn ngữ toxic.",
        "toxicity_mistral_reason": "The word 'giống này' (this kind/type) is often used in a derogatory or dismissive manner to generalize or belittle a person, group, or thing. Without additional context, it carries a negative connotation and can imply contempt or disdain, especially if directed at an individual or a specific group.",
        "toxicity_qwen_reason": "The phrase 'giống này' is a neutral expression meaning 'this kind' or 'like this', commonly used in casual speech to refer to something previously mentioned. It lacks any negative intent, insult, or derogatory connotation. Without additional context indicating mockery or targeting, it is considered non-toxic.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Cụm từ chung chung nghĩa là “loại/giống này”, không có đối tượng bị nhắm tới, không hàm ý xúc phạm hay thái độ thù địch."
    },
    {
        "text": "ngọc anh vũ vay e nat that sao",
        "category": "lgbtq",
        "id": "lgbtq_4199",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "Text targets an individual with 'nat' (nát), implying they are crushed or in a pitiful state, which is demeaning and introduces negativity in a mocking tone.",
        "toxicity_mistral_reason": "The text 'ngọc anh vũ vay e nat that sao' appears to be a casual or playful inquiry about someone named Ngọc Anh Vũ borrowing something (possibly 'nat' as slang for 'nợ' or debt) and whether it's true. There is no insult, mockery, profanity, or negative intent toward any individual or group. The tone is neutral and lacks toxic elements.",
        "toxicity_qwen_reason": "The text appears to be a phonetic or shorthand way of writing a neutral or conversational phrase, possibly 'Ngọc Anh Vũ, vay em nát thật sao?' which could mean 'Ngọc Anh Vũ, did you really get badly beaten (in a game)?'. While 'nát' can mean 'destroyed' or 'crushed', in gaming context it's commonly used to describe poor performance without direct personal attack. There's no evident slur, insult, or harmful intent. Tone seems informal but not hostile.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu hỏi viết không dấu/teen-code, nội dung chỉ hỏi “vậy em nát thật sao” (nát = tệ/đuối/hết sức), không có chửi tục hay công kích trực tiếp cá nhân/nhóm; không chứa miệt thị, đe doạ hay kỳ thị."
    },
    {
        "text": "ý là câu kì thị người bắc",
        "category": "region",
        "id": "region_27020",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "Câu này chỉ mang tính giải thích hoặc nhận xét về ý nghĩa của một câu nói khác, không trực tiếp chứa lời lẽ xúc phạm, phân biệt đối xử, hoặc thể hiện thái độ thù địch, mỉa mai nào. Nó không nhắm mục tiêu công kích cá nhân hay nhóm cụ thể, và giọng điệu trung lập.",
        "toxicity_mistral_reason": "The text explicitly mentions 'kì thị người Bắc' (discrimination against Northern Vietnamese people), which directly refers to regional bias or prejudice. Even though the speaker may be criticizing such discrimination, the phrasing itself acknowledges and reinforces the existence of toxic regional stereotypes, making it contextually toxic.",
        "toxicity_qwen_reason": "Câu nói ám chỉ, chế giễu người miền Bắc (Bắc Kỳ) - một cách gọi xưa thường mang sắc thái phân biệt vùng miền. Trong bối cảnh xã hội Việt Nam, việc dùng từ như 'Bắc Kỳ' kèm biểu cảm cười (😂) hoặc ngữ cảnh chế nhạo dễ trở thành ngôn ngữ kỳ thị, đặc biệt khi liên quan đến danh xưng gắn với lịch sử và định kiến. Đây là hình thái kỳ thị địa phương, mang tính xúc phạm gián tiếp nhưng rõ ràng.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu nói chỉ mô tả/nhận xét về hành vi ‘kì thị người Bắc’, không trực tiếp xúc phạm hay công kích cá nhân/nhóm nào và không dùng từ ngữ thô tục."
    },
    {
        "text": "cái này thì biết này ai hỏi thì hỏi đi khác vs thanh hoá nhé",
        "category": "region",
        "id": "region_14753",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "Câu nói mang tính chất thông báo, hướng dẫn hoặc đề cập đến sự khác biệt về cách thức (hỏi khác đi) có liên quan đến địa danh Thanh Hóa. Không chứa ngôn ngữ xúc phạm, lăng mạ, kỳ thị trực tiếp nào nhắm vào cá nhân hay nhóm người từ Thanh Hóa. Ngữ khí có vẻ là nhắc nhở thông thường, không có dấu hiệu chế giễu, miệt thị hoặc dùng các thành ngữ, biệt ngữ mang tính tiêu cực rõ ràng về vùng miền.",
        "toxicity_mistral_reason": "The comment implies a regional bias by contrasting 'this' (unspecified but likely referring to a local or general context) with 'Thanh Hóa' in a dismissive or derogatory manner. The phrase 'khác vs Thanh Hóa nhé' subtly suggests a negative stereotype or inferiority associated with Thanh Hóa, which can be seen as demeaning to people from that region.",
        "toxicity_qwen_reason": "Câu nói mang tính khẳng định cá nhân về sự khác biệt ('khác vs Thanh Hóa'), nhưng không có yếu tố miệt thị, chế giễu hay sử dụng thành kiến về miền khác. Không có dấu hiệu của teen-code mang tính phân biệt vùng miền hay định kiến văn hóa. Tuy có nhắc đến Thanh Hóa, nhưng không đi kèm với cụm từ mang tính stereotype (như 'rau má', 'phá đường tàu',...), nên không mang tính độc hại.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Chỉ nêu thông tin và nhắc ‘khác với Thanh Hóa’ mà không kèm từ ngữ miệt thị hay chế giễu; không có mục tiêu xúc phạm cá nhân hay nhóm nào."
    },
    {
        "text": "đoàn công thịnh ukm cố lên nè anh cố lên , ráng đẻ nha , đẻ hộ mấy đứa kh đẻ á",
        "category": "lgbtq",
        "id": "lgbtq_635",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "The comment uses 'đẻ' (give birth) in a metaphorical, encouraging sense common in Vietnamese online slang, meaning to produce or create something (like content). The tone is supportive ('cố lên', 'ráng'), not hostile or demeaning. While the phrase 'đẻ hộ mấy đứa kh đẻ á' could be interpreted literally, in this conversational context it's more likely a playful exaggeration of encouragement, not a targeted insult about fertility.",
        "toxicity_mistral_reason": "The comment is supportive and encouraging ('cố lên', 'ráng đẻ nha'), even though it uses informal and playful language ('ukm', 'đẻ hộ mấy đứa kh đẻ'). There is no insult, mockery, or negative targeting of any individual or group. The tone is lighthearted and motivational.",
        "toxicity_qwen_reason": "The use of 'ráng đẻ nha, đẻ hộ mấy đứa kh đẻ á' is a mocking and vulgar joke about childbirth directed at a man, implying absurdity and using reproductive functions in a derogatory, humiliating way. Combined with the informal and sarcastic tone ('ukm', exaggerated encouragement), it constitutes a non-consensual, body-related tease that mocks masculinity and is culturally inappropriate, thus qualifying as toxic.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Giọng điệu chủ yếu là cổ vũ, đùa vui về chuyện sinh con (“ráng đẻ”, “đẻ hộ mấy đứa không đẻ”). Không có chửi bới, miệt thị hay công kích cá nhân/nhóm cụ thể; cách nói “mấy đứa không đẻ” hơi bông đùa nhưng không thể hiện thái độ thù địch rõ rệt."
    },
    {
        "text": "bọn nó bị ghen tị vì thanh hóa nổi tiếng tiếng hơn thành tích nổi trội hơn",
        "category": "region",
        "id": "region_35065",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "Câu này thể hiện quan điểm bênh vực hoặc tự hào về Thanh Hóa, cho rằng những người khác ghen tị vì thành tích và danh tiếng của tỉnh này. Tuy có dùng từ 'bọn nó' mang tính chung chung và hơi tiêu cực, nhưng không chứa ngôn từ xúc phạm, phân biệt vùng miền rõ rệt, hay nhắm vào nhóm yếu thế nào. Giọng điệu mang tính khẳng định, không có dấu hiệu mỉa mai, chế nhạo hoặc thù địch.",
        "toxicity_mistral_reason": "The comment uses 'bọn nó' (a dismissive/derogatory term for 'them') to generalize and imply resentment or jealousy toward a group, likely targeting people from a different region (implied by the mention of Thanh Hóa). The tone is sarcastic and mocking, suggesting regional bias or rivalry, which can perpetuate negativity and division.",
        "toxicity_qwen_reason": "The statement promotes regional bias by claiming people from Thanh Hóa are superior in fame and achievement ('nổi tiếng hơn', 'thành tích nổi trội hơn'), which can incite resentment or division. The phrase 'bọn nó bị ghen tị' (they are jealous) dismisses others with disdain and stereotypes them as envious, fostering hostility between regions.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Giọng điệu khoe vùng miền và cho rằng ‘bọn nó’ ghen tị, nhưng không có chửi bới, xúc phạm cụ thể hay định kiến với nhóm nào. ‘Bọn nó’ hơi thiếu lịch sự nhưng chỉ là phán đoán tiêu cực nhẹ, không mang tính thù ghét hay kỳ thị."
    },
    {
        "text": "linh sẽ gầy ngô tiến cường",
        "category": "lgbtq",
        "id": "lgbtq_14486",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The text 'linh sẽ gầy ngô tiến cường' appears to be a neutral statement or possibly an inside joke about someone named Linh becoming thin, with 'ngô tiến cường' likely referring to a person or benchmark. There is no clear evidence of mockery, sarcasm, insults, or negative targeting based on the literal meaning, cultural context, or tone. Without implicit signals of toxicity, it does not meet the criteria for harsh, disrespectful, or abusive language.",
        "toxicity_mistral_reason": "The phrase 'gầy ngô tiến cường' is a derogatory play on words targeting a person's appearance. 'Ngô tiến cường' is a mocking deformation of 'Ngô Tiến Cường' (a Vietnamese name), and 'gầy' (skinny) is used here to imply an insult about the person's physique. The tone is clearly mocking and disrespectful.",
        "toxicity_qwen_reason": "The text 'linh sẽ gầy ngô tiến cường' appears to be a play on words or a misstatement, possibly combining names ('Linh', 'Ngô Tiến Cường') with the word 'gầy' (thin/skinny). However, there is no clear intent to insult, mock, or target anyone negatively. It lacks hostile tone, profanity, or discriminatory context. Without further evidence of sarcasm or derogatory intent, it is best interpreted as neutral or nonsensical rather than toxic.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu ngắn, không có lời lẽ xúc phạm hay miệt thị. Có thể là nhắc tên người (Linh, Ngô Tiến Cường) hoặc dự đoán 'sẽ gầy' mang tính mô tả, không thể hiện thái độ thù địch hay chế nhạo."
    },
    {
        "text": "t đâu phải dân thanh hoá đâu mà lấy lmj",
        "category": "region",
        "id": "region_7572",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The text is a personal statement denying association with people from Thanh Hóa and expressing dismissiveness ('lấy lmj' meaning 'why should I care'). While it may imply a negative perception of the region, it does not directly insult, threaten, or use abusive language towards any individual or group. The tone is informal and defensive but not overtly hostile or demeaning.",
        "toxicity_mistral_reason": "The comment implies a negative stereotype about people from Thanh Hóa ('dân Thanh Hóa') by questioning the relevance or appropriateness of associating the speaker with them ('lấy lmj' – 'take what?'). This can be interpreted as a subtle insult or mockery toward the region or its people, carrying a dismissive and potentially derogatory tone.",
        "toxicity_qwen_reason": "The text expresses personal denial of being from Thanh Hóa and not engaging in a certain behavior ('lấy lmj' likely meaning 'lấy làm gì' – 'why would I do that'). It does not insult or mock any individual or group. While 'dân Thanh Hóa' can sometimes be the target of stereotypes (e.g., 'rau má' stereotype), here the speaker distances themselves without belittling the region, so the statement lacks toxic intent or derogatory tone.",
        "toxicity": "TOXIC",
        "toxicity_gpt_reason": "Nhắc “dân Thanh Hoá” theo cách loại trừ (“t đâu phải… đâu mà lấy làm gì”) hàm ý chỉ người Thanh Hoá mới làm việc đó, gợi định kiến vùng miền và thái độ miệt thị nhóm."
    },
    {
        "text": "nhii hoànqq nghe chưa, mai mốt hong có coi ba cái đồi truỵ này nghe chưa, kẻo lệch lạc đó",
        "category": "lgbtq",
        "id": "lgbtq_11939",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "Đây là một lời cảnh báo hoặc nhắc nhở mang tính quan tâm, khuyên người nghe không nên xem những nội dung 'đồi truỵ' (suy đồi) để tránh bị ảnh hưởng xấu ('lệch lạc'). Mặc dù sử dụng từ ngữ mạnh ('đồi truỵ'), giọng điệu và mục đích là xây dựng, thể hiện sự lo lắng chứ không phải tấn công, chế giễu hay thể hiện sự thù địch với cá nhân hay nhóm nào.",
        "toxicity_mistral_reason": "The text uses harsh and disrespectful language ('ba cái đồi truỵ') to criticize someone's content or preferences, implying it is immoral or corrupting. The tone is aggressive and demeaning, with phrases like 'kẻo lệch lạc đó' (or else you'll be corrupted) adding to the hostility. The intent is to shame or control the target's behavior, making it toxic.",
        "toxicity_qwen_reason": "The text uses derogatory and shaming language ('đồi truỵ' – depraved, 'lệch lạc' – deviant) to condemn someone's behavior, implying moral superiority and targeting the person with judgmental tone. The phrase 'mai mốt hong có coi' (stop watching) combined with 'kẻo lệch lạc' suggests that consuming certain content will lead to moral corruption, which is dismissive and stigmatizing. This kind of language promotes exclusion and condemnation, especially toward personal choices, making it toxic in tone.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Mang tính nhắc nhở/khuyên răn không xem nội dung đồi trụy; không có chửi bới, xúc phạm trực tiếp hay công kích cá nhân/nhóm. Cụm “ba cái đồi trụy” phê phán nội dung, “kẻo lệch lạc” là lời cảnh báo, giọng điệu nghiêm nhưng không mang tính lăng mạ."
    },
    {
        "text": "bùii minh đậu yêu nhau mẹ ik bạn😂",
        "category": "lgbtq",
        "id": "lgbtq_8724",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "NON-TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "The text appears to be a casual, humorous comment using slang and an emoji in a playful tone. There is no direct insult, threat, hate speech, or demeaning content targeting individuals or groups. The mild profanity 'mẹ ik' is used as an exclamation without malice, and the laughter emoji likely indicates light-heartedness rather than mockery.",
        "toxicity_mistral_reason": "The text uses playful teen slang ('bùii' for 'bây giờ', 'ik' for 'i know') and expresses affection in a lighthearted way ('yêu nhau mẹ'). The laughing emoji (😂) conveys humor rather than mockery or hostility. There is no insult, profanity, or negative targeting of any individual or group.",
        "toxicity_qwen_reason": "The phrase 'bùii minh đậu' is a phonetic distortion of 'Bùi Minh Đạo', a public figure, used mockingly. 'yêu nhau mẹ ik bạn' is a nonsensical, absurd pairing of words that, combined with the laughing emoji 😂, creates a ridiculing tone. This type of teen-code distorts names and language to mock individuals, showing disrespect and derision.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Teasing/playful tone about two people liking each other; the slang 'mẹ' is a mild intensifier not directed as an insult. No hostility, threats, or discriminatory content."
    },
    {
        "text": "thấy tụi bk nó ăn gì",
        "category": "region",
        "id": "region_3346",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "Sử dụng 'bk' là từ viết tắt mang tính miệt thị, phân biệt vùng miền đối với người miền Bắc. Cách dùng 'tụi' và 'nó' thể hiện sự xa cách, khinh miệt, gây chia rẽ cộng đồng.",
        "toxicity_mistral_reason": "The phrase 'tụi bk' is a derogatory term often used to refer to people from Bắc Kỳ (Northern Vietnam), carrying a mocking or dismissive tone. The context implies a negative stereotype or bias against a regional group, which aligns with toxic language targeting a specific community.",
        "toxicity_qwen_reason": "The phrase 'thấy tụi bk nó ăn gì' translates to 'wonder what people from BK are eating', where 'BK' likely refers to students from Bách Khoa (a university in Vietnam, often with a regional or school-based context). While it might carry mild curiosity or informal teasing, it does not contain insults, profanity, or clear derogatory intent. Without additional context suggesting mockery or negative stereotypes, it remains within neutral, colloquial speech.",
        "toxicity": "TOXIC",
        "toxicity_gpt_reason": "“bk” nhiều khả năng là viết tắt miệt thị của “Bắc Kỳ” (người miền Bắc). Cách gọi “tụi … nó” mang sắc thái hạ thấp/xa cách, nhằm chỉ một nhóm người theo vùng miền → hàm ý kỳ thị khu vực dù không chửi thẳng."
    },
    {
        "text": "k phải do b mà do con sâu lm rầu nồi canh 🙄",
        "category": "region",
        "id": "region_33556",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "Câu này sử dụng thành ngữ 'con sâu làm rầu nồi canh' để đổ lỗi và gán nhãn tiêu cực cho một cá nhân (ẩn dụ là 'con sâu'), kết hợp với biểu tượng 🙄 thể hiện thái độ khinh thường, mỉa mai. Mặc dù không chứa ngôn từ thô tục trực tiếp, nó mang tính chất đổ lỗi, gây mất đoàn kết và tạo ra sự thù địch trong giao tiếp.",
        "toxicity_mistral_reason": "The text uses a dismissive and mocking tone ('k phải do b mà do con sâu lm rầu nồi canh') to imply blame or criticism in a sarcastic way. The phrase 'con sâu làm rầu nồi canh' is a Vietnamese idiom meaning one bad person ruins everything, but here it is used to indirectly target someone (likely 'b'—short for 'bạn' or a specific person) in a negative and disrespectful manner. The eye-roll emoji (🙄) further signals contempt or frustration, reinforcing the toxic intent.",
        "toxicity_qwen_reason": "The phrase 'con sâu làm rầu nồi canh' is a common Vietnamese idiom meaning a single bad element spoils the whole group. While it criticizes someone indirectly, it's used generally and not targeted with abusive intent. The eye-roll emoji (🙄) suggests mild annoyance, not hostility or derision. The tone is more expressive than toxic.",
        "toxicity": "TOXIC",
        "toxicity_gpt_reason": "Dùng ẩn dụ “con sâu làm rầu nồi canh” để chỉ một người gây hại, kèm emoji 🙄 thể hiện thái độ khinh miệt/khó chịu. Mang tính hạ thấp và tiêu cực dù không nhắm trực tiếp vào người đối thoại."
    },
    {
        "text": "không ấy nhưng trung kỳ nó ở đâu ra thế nhờ :)))?",
        "category": "region",
        "id": "region_11372",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "The comment uses 'Trung Kỳ' in a sarcastic question with laughter (:)))), implying mockery or disbelief towards Central Vietnam, which perpetuates regional stereotypes and introduces negativity through disrespectful tone.",
        "toxicity_mistral_reason": "The phrase 'trung kỳ' (Central Vietnam) is used in a mocking tone, implying ignorance or stupidity ('nó ở đâu ra thế nhờ'). The emoji ':)))' adds sarcasm, reinforcing the dismissive and derogatory intent toward people from Central Vietnam. This perpetuates regional bias and disrespect.",
        "toxicity_qwen_reason": "The text is a lighthearted, joking inquiry about the origin of 'Trung Kỳ' (Central Vietnam), using casual language and a smiling emoji ':)))'. It does not mock any group, contain derogatory terms, or express hostility. The tone appears curious and playful rather than disrespectful or discriminatory.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Câu hỏi mang tính bông đùa về thuật ngữ/nguồn gốc “trung kỳ”, không có lời lẽ xúc phạm hay nhắm vào cá nhân/nhóm cụ thể. Dấu cười :))) thể hiện giọng điệu thoải mái chứ không chế giễu ai."
    },
    {
        "text": "tôi muốn thật đấy nhưng ty lgbt không quá đau khổ",
        "category": "lgbtq",
        "id": "lgbtq_30419",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "The text expresses a personal observation that LGBT relationships are not excessively painful, without using insulting, abusive, or discriminatory language. It maintains a neutral tone, does not target any individual or group negatively, and lacks elements of mockery, sarcasm, or hostility as defined in toxic content.",
        "toxicity_mistral_reason": "The comment uses the term 'ty lgbt' (short for 'thể loại LGBT') in a dismissive or mocking tone, implying that being LGBTQ+ is a 'type' or category rather than a natural identity. The phrase 'không quá đau khổ' (not too painful) trivializes the struggles and discrimination faced by the LGBTQ+ community, which can be seen as belittling or insensitive. While the intent may not be overtly hostile, the wording carries implicit negativity and stereotypes.",
        "toxicity_qwen_reason": "Câu 'tôi muốn thật đấy nhưng ty lgbt không quá đau khổ' sử dụng cách nói mỉa mai, giảm nhẹ nỗi đau hoặc khó khăn mà cộng đồng LGBT có thể gặp phải. Việc đùa cợt hay phủ nhận cảm xúc của một nhóm thiểu số dựa trên định danh giới tính hoặc xu hướng tình dục là hành vi xúc phạm, thiếu tôn trọng và mang tính tiêu cực, phù hợp với định nghĩa về ngôn ngữ độc hại.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "‘ty’ = ‘tình yêu’; câu nói nhận xét trung tính rằng tình yêu LGBT ‘không quá đau khổ’, không dùng từ miệt thị, không chế giễu hay tấn công cá nhân/nhóm."
    },
    {
        "text": "caliduquebacang",
        "category": "region",
        "id": "region_9896",
        "toxicity_deepseek": "NON-TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "TOXIC",
        "toxicity_deepseek_reason": "The phrase 'caliduquebacang' appears to be a nonsensical or playful string of syllables with no clear meaning in Vietnamese. It does not contain insults, slurs, hate speech, or any identifiable toxic content. Without cultural or contextual cues indicating malice, it is classified as non-toxic.",
        "toxicity_mistral_reason": "The text 'caliduquebacang' is a phonetic deformation of 'cái lũ Bắc Kỳ', where 'Bắc Kỳ' is a historically loaded term often used as a slur to refer to Northern Vietnamese. The deformation itself carries a mocking tone, implying disdain or derision toward people from that region.",
        "toxicity_qwen_reason": "The term 'caliduquebacang' appears to be a distorted, mocking phonetic spelling of 'cà lì đụ tui quá cạn' or similar vulgar expression, commonly used in crude or aggressive tone. Such distortions are often employed to evade detection while retaining offensive intent. In Vietnamese online slang, this style of misspelling frequently carries disrespectful or vulgar connotations, especially when used mockingly. The phrase seems to express exaggerated annoyance or insult in a vulgar manner, fitting the pattern of toxic language.",
        "toxicity": "NON-TOXIC",
        "toxicity_gpt_reason": "Chuỗi ký tự không rõ nghĩa/không thành câu tiếng Việt; không thấy mục tiêu, xúc phạm, chửi thề hay ngữ điệu tiêu cực."
    },
    {
        "text": "em trai duong gio tai à",
        "category": "region",
        "id": "region_34961",
        "toxicity_deepseek": "TOXIC",
        "toxicity_mistral": "TOXIC",
        "toxicity_qwen": "NON-TOXIC",
        "toxicity_deepseek_reason": "Câu nói sử dụng cách gọi 'em trai' kèm cụm từ 'duong gio tai' (có thể hiểu là 'đường gió tai' - ám chỉ nói nhảm hoặc làm điều vô nghĩa) với giọng điệu mỉa mai, thể hiện sự chế giễu, coi thường đối với người nghe, tạo ra sự tiêu cực trong giao tiếp.",
        "toxicity_mistral_reason": "The phrase 'em trai đường gio' is a derogatory slur targeting gay men in Vietnamese slang ('đường gio' is a phonetic deformation of 'đồng giới,' meaning same-sex relationships). The comment implies mockery or disrespect toward LGBTQ+ individuals, which qualifies as toxic language.",
        "toxicity_qwen_reason": "The text 'em trai duong gio tai à' appears to be a neutral or possibly affectionate way of addressing someone as 'brother' ('em trai') with a playful or teasing tone ('duong gio tai à' – likely meaning 'are you windy-eared?'). However, there is no clear evidence of mockery, insult, or toxic intent. Without further context indicating derogatory use of slang or harmful subtext, this expression remains within the realm of casual, non-offensive banter.",
        "toxicity": "TOXIC",
        "toxicity_gpt_reason": "Cụm “duong gio tai” là méo tả của “đường/định hướng giới tính”, dùng để gợi ý, mỉa mai về giới tính/đồng tính của người nghe. Cách hỏi mang tính chế giễu nhắm vào xu hướng tính dục → xúc phạm/kỳ thị."
    }
]